
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НачальнаяИнициализация();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
			
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура УчастникНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Аук_ОбщийКлиент.НачатьВыборУчастника(ЭтотОбъект, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактноеЛицоНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Аук_ОбщийКлиент.НачатьВыборКонтактногоЛица(ЭтотОбъект, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура УчастникОчистка(Элемент, СтандартнаяОбработка)
	
	ЭтотОбъект.КонтактноеЛицо = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура УчастникПриИзменении(Элемент)
	
	Аук_ОбщийКлиент.УчастникПриИзменении(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура Принять(Команда)
	
	ЗафиксироватьИнформациюОтУчастников();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗафиксироватьИнформациюОтУчастников()
	
	Если ПроверитьЗаполнение() Тогда	
		
		Закрыть(ДанныеОтказаИзДанныхФормы());
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ДанныеОтказаИзДанныхФормы()
	
	сткРезультат = Новый Структура;
	
	сткРезультат.Вставить("Аукцион",		ЭтотОбъект.Аукцион);
	сткРезультат.Вставить("Участник",		ЭтотОбъект.Участник);
	сткРезультат.Вставить("КонтактноеЛицо",	ЭтотОбъект.КонтактноеЛицо);
	сткРезультат.Вставить("Данные",			ЭтотОбъект.ТекстПримечания);
	
	Возврат сткРезультат;
	
КонецФункции

&НаСервере
Процедура НачальнаяИнициализация()
	
	ЭтотОбъект.Аукцион	= Параметры.Аукцион;
	
	Аук_ОбщийСервер.ЗаполнитьДанныеДляОтборовНаФорме(ЭтотОбъект);
		
КонецПроцедуры

#КонецОбласти

