
#Область ПрограммныйИнтерфейс

Функция ДобавитьЗапись(пСтруктураЗаписи) Экспорт
	
	Возврат Аук_ОбщийСервер.ДобавитьЗаписьВРегистрСведений(пСтруктураЗаписи, "Аук_ИсторияСтатусовАукционов");
	
КонецФункции

Функция УдалитьЗапись(пСтруктураЗаписи) Экспорт
	
	Возврат Аук_ОбщийСервер.УдалитьНаборЗаписейВРегистреСведений(пСтруктураЗаписи, "Аук_ИсторияСтатусовАукционов");
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекущееСостояниеАукциона(пАукцион, пДата = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Аук_ИсторияСтатусовАукционовСрезПоследних.Аукцион КАК Аукцион,
	|	Аук_ИсторияСтатусовАукционовСрезПоследних.Статус КАК Статус,
	|	Аук_ИсторияСтатусовАукционовСрезПоследних.НомерЭтапа КАК НомерЭтапа,
	|	Аук_ИсторияСтатусовАукционовСрезПоследних.Этап КАК Этап
	|ИЗ
	|	РегистрСведений.Аук_ИсторияСтатусовАукционов.СрезПоследних(&НаДату, Аукцион = &Аукцион) КАК Аук_ИсторияСтатусовАукционовСрезПоследних";
	
	Запрос.УстановитьПараметр("Аукцион",	пАукцион);
	Запрос.УстановитьПараметр("НаДату",		пДата);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ЭдоОбщийСервер.РезультатЗапросаВСтруктуру(РезультатЗапроса);
	
КонецФункции	

#КонецОбласти
