
#Область ПрограммныйИнтерфейс

Функция ОбязательныеПоляКомандыВСтрокеJSON() Экспорт

	масРезультат = Новый Массив;
	
	масРезультат.Добавить("command");
	масРезультат.Добавить("auction");
	
	Возврат масРезультат;
	
КонецФункции

Функция БазоваяСтруктураДанныхДляКоманды() Экспорт
		
	Возврат Аук_ОбщийКлиентСервер.СтруктураПоМассивуИмен(ОбязательныеПоляКомандыВСтрокеJSON());
	
КонецФункции

Функция РасширеннаяСтруктураДанныхДляКоманды(пДобавитьДопДанные = Ложь) Экспорт

	сткРезультат = БазоваяСтруктураДанныхДляКоманды();
	
	сткРезультат.Вставить("required_data");
	
	Если пДобавитьДопДанные Тогда
		
		сткРезультат.Вставить("optional_data");
	
	КонецЕсли;
	
	Возврат сткРезультат;
	
КонецФункции

Функция ПроверкаОбязательныхСвойствВДанныхКоманды(пСткДанные) Экспорт
	
	масОбязательныПоля = ОбязательныеПоляКомандыВСтрокеJSON();
	
	Возврат ПроверкаДополнительныхСвойствВДанныхКомандыПоСписку(пСткДанные, масОбязательныПоля);	
		
КонецФункции

Функция ПроверкаДополнительныхСвойствВДанныхКомандыПоСписку(пДанные, пИменаПолей) Экспорт
		
	масОшибки = Новый Массив;
	
	Если ТипЗнч(пДанные) = Тип("Структура") Тогда
		
		Для Каждого ЭлМас Из пИменаПолей Цикл
			
			Если Не пДанные.Свойство(ЭлМас) Тогда
				
				масОшибки.Добавить(СтрШаблон(НСтр("ru = 'Отсутствует обязательное поле ""%1"".'"), ЭлМас));
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе	
		ВызватьИсключение "Неопр. тип";	
	КонецЕсли;
	
	Если масОшибки.Количество() <> 0 Тогда	
		Возврат ЭдоОбщий._Ошибка(СтрСоединить(масОшибки, Символы.ПС));	
	Иначе	
		Возврат ЭдоОбщий._Успех();	
	КонецЕсли;	
		
КонецФункции

Функция ПроверкаДополнительныхСвойствВДанныхКомандыПоСтроке(пСткДанные, пСтрИменаПолей) Экспорт
	
	масИменаПолей = СтрРазделить(пСтрИменаПолей, ",");
	
	Возврат ПроверкаДополнительныхСвойствВДанныхКомандыПоСписку(пСткДанные, масИменаПолей);	
		
КонецФункции

Функция СлужебноеОповещение_СтруктураОбязательныхДанных() Экспорт

	Возврат Аук_ОбщийКлиентСервер.СтруктураПоМассивуИмен(СлужебноеОповещение_ОписаниеСтруктурыОбязательныхДанных());
	
КонецФункции	

Функция ПромежутокВремениМеждуОповещениямиМинут() Экспорт // 15
	Возврат 15;	
КонецФункции

Функция КоличествоСлужебныхОповещений() Экспорт
	Возврат 2;	
КонецФункции

#КонецОбласти

#Область РаботаСШаблонамиСообщений

Функция ШаблонСообщенияВТекст(пСтрШаблон, пСткПараметры) Экспорт
	// 1. Распарсить шаблон, извлечь параметры
	масПараметрыШаблона = Аук_ОбщийВызовСервера.ЗначенияПараметровШаблонаПоСтрокеШаблона(пСтрШаблон, пСткПараметры);
	
	// 2. Подставить в шаблон
	
КонецФункции	

#КонецОбласти

#Область СтруктураОбязательныхДанныхКоманд

Функция СлужебноеОповещение_ОписаниеСтруктурыОбязательныхДанных() Экспорт

	масРезультат = Новый Массив;
	
	масРезультат.Добавить("recipients");
	масРезультат.Добавить("subject");
	масРезультат.Добавить("message");
	
	Возврат масРезультат;
	
КонецФункции

Функция ОтправитьСообщениеУчастнику_ОписаниеСтруктурыОбязательныхДанных() Экспорт

	масРезультат = Новый Массив;
	
	масРезультат.Добавить("channel");
	масРезультат.Добавить("channel_settings");
	масРезультат.Добавить("message");
	масРезультат.Добавить("subject");
	масРезультат.Добавить("period");
	масРезультат.Добавить("data_element");
	масРезультат.Добавить("template_parameter_values");
	масРезультат.Добавить("stage_number");
	
	Возврат масРезультат;
	
КонецФункции

Функция ПолучениеДанныхОтУчастника_ОписаниеСтруктурыОбязательныхДанных() Экспорт

	масРезультат = Новый Массив;
	
	масРезультат.Добавить("data_type");
	масРезультат.Добавить("data"); 
	масРезультат.Добавить("confirmation_required");
	масРезультат.Добавить("message_type");
	
	Возврат масРезультат;
	
КонецФункции

Функция ЗафиксироватьПромежуточныеИтогиАукциона_ОписаниеСтруктурыОбязательныхДанных() Экспорт

	масРезультат = Новый Массив;
	
	масРезультат.Добавить("bid_date");
	масРезультат.Добавить("participant");
	масРезультат.Добавить("data_element");
	
	масРезультат.Добавить("stage_number");
	масРезультат.Добавить("calculation_result");
	масРезультат.Добавить("calculation_result_view");
		
	Возврат масРезультат;
	
КонецФункции

Функция ЗавершитьАукцион_ОписаниеСтруктурыОбязательныхДанных() Экспорт

	масРезультат = Новый Массив;
	
	масРезультат.Добавить("total_amount");
	масРезультат.Добавить("total_time"); 
	масРезультат.Добавить("auction_results");
	масРезультат.Добавить("only_saving");
	
	Возврат масРезультат;
	
КонецФункции	

#КонецОбласти

#Область ОбязательныеПараметрыКоманд

Процедура ЗафиксироватьДанныеСтавки_ОбщиеПараметры(пСткПараметры) Экспорт

	пСткПараметры.Вставить("ВидДанных",					ПредопределенноеЗначение("Перечисление.Аук_ВидыДанных.Ставка"));
	пСткПараметры.Вставить("ТребуетсяПодтверждение",	Истина);
	пСткПараметры.Вставить("ВидСообщения",				ПредопределенноеЗначение("Перечисление.Аук_ВидыСообщенийУчастникам.УведомлениеУчастникаОПриемеСтавки"));
	
КонецПроцедуры	

Процедура ЗафиксироватьОтказОтУчастия_ОбщиеПараметры(пСткПараметры) Экспорт

	пСткПараметры.Вставить("ВидДанных",					ПредопределенноеЗначение("Перечисление.Аук_ВидыДанных.Отказ"));	
	пСткПараметры.Вставить("ТребуетсяПодтверждение",	Истина);
	пСткПараметры.Вставить("ВидСообщения",				ПредопределенноеЗначение("Перечисление.Аук_ВидыСообщенийУчастникам.УведомлениеУчастникаОПриемеОтказа"));
	
КонецПроцедуры

Процедура ЗафиксироватьСообщениеОтУчастника_ОбщиеПараметры(пСткПараметры) Экспорт

	пСткПараметры.Вставить("ВидДанных",					ПредопределенноеЗначение("Перечисление.Аук_ВидыДанных.Сообщение"));	
	пСткПараметры.Вставить("ТребуетсяПодтверждение",	Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ТекстыСлужебныхСообщений

Функция ИнформированииОНеобходимостиСтартоватьАукцион() Экспорт
	
	сткСообщение = Новый Структура;
	
	сткСообщение.Вставить("ТемаПисьма",		НСтр("ru = 'Аукцион %1 ожидает старта'"));
	
	сткСообщение.Вставить("ШаблонПисьма",
	"<p>
	|    Аукцион ""<strong>%1</strong>"" [%2] должен был начаться %3.
	|    Произведите запуск аукциона вручную.
	|</p>
	|<p>
	|    <a href=""%4"">Ссылка на аукцион</a>
	|</p>"
	);
		
	Возврат сткСообщение
	
КонецФункции

Функция ИнформированииОНеобходимостиПеревестиАукционНаСледующийЭтап() Экспорт
	
	сткСообщение = Новый Структура;
	
	сткСообщение.Вставить("ТемаПисьма",		НСтр("ru = 'Аукцион %1 ожидает перевода на следующий этап'")); 
	
	сткСообщение.Вставить("ШаблонПисьма",
	"<p>
	|    Аукцион ""<strong>%1</strong>"" [%2] необходимо перевести на следующий этап.
	|    Переведите аукцион на следующий этап вручную.
	|</p>
	|<p>
	|    <a href=""%3"">Ссылка на аукцион</a>
	|</p>"
	);
	
	Возврат сткСообщение
	
КонецФункции

Функция ИнформированииОНеобходимостиПодведенияПромежуточныхИтогов() Экспорт
	
	сткСообщение = Новый Структура;
	
	сткСообщение.Вставить("ТемаПисьма",		НСтр("ru = 'Аукцион %1 ожидает подведения промежуточных итогов'")); 
	
	сткСообщение.Вставить("ШаблонПисьма",
	"<p>
	|    По аукциону ""<strong>%1</strong>"" [%2] необходимо подвести промежуточные итоги.
	|    Подведите промежуточные итоги по аукциону вручную.
	|</p>
	|<p>
	|    <a href=""%3"">Ссылка на аукцион</a>
	|</p>"
	);	
	
	Возврат сткСообщение
	
КонецФункции

Функция ИнформированииОНеобходимостиЗавершенияАукциона() Экспорт
	
	сткСообщение = Новый Структура;
	
	сткСообщение.Вставить("ТемаПисьма",		НСтр("ru = 'Аукцион %1 ожидает завершения'")); 
	
	сткСообщение.Вставить("ШаблонПисьма",
	"<p>
	|    Аукцион ""<strong>%1</strong>"" [%2] ожидает завершения.
	|    Подведите окончательные итоги и завершите аукцион вручную.
	|</p>
	|<p>
	|    <a href=""%3"">Ссылка на аукцион</a>
	|</p>"
	);
	
	Возврат сткСообщение
	
КонецФункции

Функция ИнформированииОСтартеАукциона() Экспорт
	
	сткСообщение = Новый Структура;
	
	сткСообщение.Вставить("ТемаПисьма",		НСтр("ru = 'Автоматический старт аукциона %1'"));
	
	сткСообщение.Вставить("ШаблонПисьма",
	"<p>
	|    Аукцион ""<strong>%1</strong>"" [%2] начался %3.
	|</p>
	|<p>
	|    <a href=""%4"">Ссылка на аукцион</a>
	|</p>"
	);
		
	Возврат сткСообщение
	
КонецФункции

Функция ИнформированииОПереходеАукционаНаСледующийЭтап() Экспорт
	
	сткСообщение = Новый Структура;
	
	сткСообщение.Вставить("ТемаПисьма",		НСтр("ru = 'Автоматический переход аукциона %1 на следующий этап'"));
	
	сткСообщение.Вставить("ШаблонПисьма",
	"<p>
	|    Аукцион ""<strong>%1</strong>"" [%2] был переведен на этап %3.
	|</p>
	|<p>
	|    <a href=""%4"">Ссылка на аукцион</a>
	|</p>"
	);
		
	Возврат сткСообщение
	
КонецФункции

Функция ИнформированииОФиксацииПромежуточныхИтогов() Экспорт
	
	сткСообщение = Новый Структура;
	
	сткСообщение.Вставить("ТемаПисьма",		НСтр("ru = 'Промежуточные итоги по аукциону %1'"));
	
	сткСообщение.Вставить("ШаблонПисьма",
	"<p>
	|    По аукциону ""<strong>%1</strong>"" [%2] были зафиксированы промежуточные итоги.
	|</p>
	|<p>
	|    <a href=""%3"">Ссылка на аукцион</a>
	|</p>"
	);
		
	Возврат сткСообщение
	
КонецФункции

Функция ИнформированииОЗавершенииАукциона() Экспорт
	
	сткСообщение = Новый Структура;
	
	сткСообщение.Вставить("ТемаПисьма",		НСтр("ru = 'Завершение аукциона %1'"));
	
	сткСообщение.Вставить("ШаблонПисьма",
	"<p>
	|    Аукцион ""<strong>%1</strong>"" [%2] был завершен.
	|</p>
	|<p>
	|    <a href=""%3"">Ссылка на аукцион</a>
	|</p>"
	);
		
	Возврат сткСообщение
	
КонецФункции

#КонецОбласти
