
#Область ПрограммныйИнтерфейс

// Фоновое №1. По выполнению команд
Процедура КонтрольВыполненияКоманд() Экспорт
	
	ПроизвестиКонтрольДанныхИВыполнитьКоманды();
		
КонецПроцедуры	

// Фоновое №2. Контроллер событий 
Процедура КонтрольСостоянияАукционов() Экспорт
	
	ПроизвестиКонтрольСостоянияАукционов();	
	
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроизвестиКонтрольДанныхИВыполнитьКоманды()
	
	масКомандыОжидающиеВыполнения = РегистрыСведений.Аук_ИсторияКомандАукционов.КомандыОжидающиеВыполненияВАвтоматическомРежиме();
	
	Для Каждого сткДанныеКоманды Из масКомандыОжидающиеВыполнения Цикл
		
		ПроизвестиКонтрольДанныхИВыполнитьКоманду(сткДанныеКоманды);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроизвестиКонтрольСостоянияАукционов();

	масАукционы = АукционыОжидающиеДействия();
	
	Для Каждого сткЭлАукцион Из масАукционы Цикл
		
		НачатьПодготовкуКВыполнениюДействийСАукционами(сткЭлАукцион);
		
	КонецЦикла;
	
КонецПроцедуры

Функция АукционыОжидающиеДействия()
	
	ТекДата = ОбщегоНазначенияВызовСервера.ТекущаяДатаСервер_();
	
	масАукционы = Новый Массив;
	
	масРезультат = Справочники.Аук_Аукционы.АукционыОжидающиеДействия_Запуск(ТекДата);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(масАукционы, масРезультат);
	
	масРезультат = Справочники.Аук_Аукционы.АукционыОжидающиеДействия_ПереводНаСледующийЭтап(ТекДата);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(масАукционы, масРезультат);
	
	масРезультат = Справочники.Аук_Аукционы.АукционыОжидающиеДействия_ПодведениеПромежуточныхИтогов(ТекДата);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(масАукционы, масРезультат);
	
	масРезультат = Справочники.Аук_Аукционы.АукционыОжидающиеДействия_Завершение(ТекДата);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(масАукционы, масРезультат);
	
	Возврат масАукционы;
	
КонецФункции	

Процедура НачатьПодготовкуКВыполнениюДействийСАукционами(пСткДанные)
	
	// Ошибка может возникнуть только с записью в БД. логируем в грейлог
	Попытка
		
		Если пСткДанные.Команда = ПредопределенноеЗначение("Перечисление.Аук_Команды.ПроверитьВозможностьНачалаАукциона") Тогда
			
			НачатьПроверкуВозможностиНачатьАукциона(пСткДанные);
			
		ИначеЕсли пСткДанные.Команда = ПредопределенноеЗначение("Перечисление.Аук_Команды.ПроверитьВозможностьПеревестиАукционНаСледующийЭтап") Тогда 
			
			НачатьПроверкуВозможностиПеревестиАукционНаСледующийЭтап(пСткДанные);
			
		ИначеЕсли пСткДанные.Команда = ПредопределенноеЗначение("Перечисление.Аук_Команды.ПроверитьВозможностьПодведенияПромежуточныхИтогов") Тогда 
			
			НачатьПроверкуВозможностиПодведенияПромежуточныхИтоговАукциона(пСткДанные);
			
		ИначеЕсли пСткДанные.Команда = ПредопределенноеЗначение("Перечисление.Аук_Команды.ПроверитьВозможностьЗавершенияАукциона") Тогда 
			
			НачатьПроверкуВозможностиЗавершенияАукциона(пСткДанные);
			
		КонецЕсли;	
		
	Исключение
		
		стрОшибка = ОписаниеОшибки();
		
		Аук_ОбщийКлиентСервер.ОтправитьСообщениеВГрейлог(стрОшибка, "Фоновое. НачатьПодготовкуКВыполнениюДействийСАукционами");
		
	КонецПопытки;	
	
КонецПроцедуры	

Процедура НачатьПроверкуВозможностиНачатьАукциона(пСткДанные)
	
	сткПараметры = Новый Структура;
	сткПараметры.Вставить("Аукцион",				пСткДанные.Аукцион);
	сткПараметры.Вставить("Команда",				пСткДанные.Команда);
	сткПараметры.Вставить("Автоматическая",			Истина);
	
	ПроверитьВозможностьНачалаАукциона_СозданиеКоманды(сткПараметры);	
	
КонецПроцедуры

Процедура НачатьПроверкуВозможностиПеревестиАукционНаСледующийЭтап(пСткДанные)
	
	сткПараметры = Новый Структура;
	сткПараметры.Вставить("Аукцион",				пСткДанные.Аукцион);
	сткПараметры.Вставить("Команда",				пСткДанные.Команда);
	сткПараметры.Вставить("Автоматическая",			Истина);
	
	ПроверитьВозможностиПеревестиАукционНаСледующийЭтап_СозданиеКоманды(сткПараметры);	
	
КонецПроцедуры

Процедура НачатьПроверкуВозможностиПодведенияПромежуточныхИтоговАукциона(пСткДанные)
	
	сткПараметры = Новый Структура;
	сткПараметры.Вставить("Аукцион",				пСткДанные.Аукцион);
	сткПараметры.Вставить("Команда",				пСткДанные.Команда);
	сткПараметры.Вставить("Автоматическая",			Истина);
	
	ПроверитьВозможностьПодведенияПромежуточныхИтоговАукциона_СозданиеКоманды(сткПараметры);	
	
КонецПроцедуры

Процедура НачатьПроверкуВозможностиЗавершенияАукциона(пСткДанные)
	
	сткПараметры = Новый Структура;
	сткПараметры.Вставить("Аукцион",				пСткДанные.Аукцион);
	сткПараметры.Вставить("Команда",				пСткДанные.Команда);
	сткПараметры.Вставить("Автоматическая",			Истина);
	
	ПроверитьВозможностьЗавершенияАукциона_СозданиеКоманды(сткПараметры);	
	
КонецПроцедуры

#КонецОбласти

#Область СозданиеКоманд

// Создание команды "Проверить возможность начала аукциона" 
//
// Параметры:
//  пСткПараметры
//	 Обзязательно:
//		*Аукцион				- Справочник.Аук_Аукционы 
//		*Автоматическая 		- Булево - признак интеративной отправки
//		*Команда 				- Перечисление.Аук_Команды
//	 Опционально:
//		*ТребуетсяОповещение	- Булево
//
//
Процедура ПроверитьВозможностьНачалаАукциона_СозданиеКоманды(пСткПараметры) Экспорт
	
	// 1. Заполнить параметры
	сткДанные = РегистрыСведений.Аук_ИсторияКомандАукционов.БазовыеПараметрыДляСозданияКоманд();
	
	ЗаполнитьЗначенияСвойств(сткДанные, пСткПараметры); 
	
	сткПараметрыДанныхJSON = Новый Структура;
	сткПараметрыДанныхJSON.Вставить("Аукцион",				пСткПараметры.Аукцион);
	сткПараметрыДанныхJSON.Вставить("Команда",				пСткПараметры.Команда);
	
	сткДанные.Вставить("Данные",			ПроверкаВозможностиНачатьАукцион_ДанныеСтрокой(сткПараметрыДанныхJSON)); 
	
	// 2. Записать команду в БД
	РегистрыСведений.Аук_ИсторияКомандАукционов.ЗафиксироватьКомандуДляВыполнения_(сткДанные);	
	
КонецПроцедуры

// Создание команды "Проверить возможность перевести аукцион на следующий этап" 
//
// Параметры:
//  пСткПараметры	
//	 Обзязательно:
//		*Аукцион				- Справочник.Аук_Аукционы 
//		*Автоматическая 		- Булево - признак интеративной отправки
//		*Команда 				- Перечисление.Аук_Команды
//	 Опционально:
//		*ТребуетсяОповещение	- Булево
//
Процедура ПроверитьВозможностиПеревестиАукционНаСледующийЭтап_СозданиеКоманды(пСткПараметры) Экспорт
	
	// 1. Заполнить параметры
	сткДанные = РегистрыСведений.Аук_ИсторияКомандАукционов.БазовыеПараметрыДляСозданияКоманд();
	
	ЗаполнитьЗначенияСвойств(сткДанные, пСткПараметры);
	
	сткПараметрыДанныхJSON = Новый Структура;
	сткПараметрыДанныхJSON.Вставить("Аукцион",				пСткПараметры.Аукцион);
	сткПараметрыДанныхJSON.Вставить("Команда",				пСткПараметры.Команда);
	
	сткДанные.Вставить("Данные",			ПроверкаВозможностиПеревестиАукционНаСледующийЭтап_ДанныеСтрокой(сткПараметрыДанныхJSON)); 
	
	// 2. Записать команду в БД
	РегистрыСведений.Аук_ИсторияКомандАукционов.ЗафиксироватьКомандуДляВыполнения_(сткДанные);
	
КонецПроцедуры

// Создание команды "Проверить возможность подведения промежуточных итогов" 
//
// Параметры:
//  пСткПараметры	
//	 Обзязательно:
//		*Аукцион				- Справочник.Аук_Аукционы 
//		*Автоматическая 		- Булево - признак интеративной отправки
//		*Команда 				- Перечисление.Аук_Команды
//	 Опционально:
//		*ТребуетсяОповещение	- Булево
//
Процедура ПроверитьВозможностьПодведенияПромежуточныхИтоговАукциона_СозданиеКоманды(пСткПараметры) Экспорт
	
	// 1. Заполнить параметры
	сткДанные = РегистрыСведений.Аук_ИсторияКомандАукционов.БазовыеПараметрыДляСозданияКоманд();
	
	ЗаполнитьЗначенияСвойств(сткДанные, пСткПараметры);
	
	сткПараметрыДанныхJSON = Новый Структура;
	сткПараметрыДанныхJSON.Вставить("Аукцион",				пСткПараметры.Аукцион);
	сткПараметрыДанныхJSON.Вставить("Команда",				пСткПараметры.Команда);
	
	сткДанные.Вставить("Данные",			ПроверкаВозможностиПодведенияПромежуточныхИтоговАукциона_ДанныеСтрокой(сткПараметрыДанныхJSON)); 
	
	// 2. Записать команду в БД
	РегистрыСведений.Аук_ИсторияКомандАукционов.ЗафиксироватьКомандуДляВыполнения_(сткДанные);
	
КонецПроцедуры

// Создание команды "Проверить возможность завершения аукциона" 
//
// Параметры:
//  пСткПараметры	
//	 Обзязательно:
//		*Аукцион				- Справочник.Аук_Аукционы 
//		*Автоматическая 		- Булево - признак интеративной отправки
//		*Команда 				- Перечисление.Аук_Команды
//	 Опционально:
//		*ТребуетсяОповещение	- Булево
//
Процедура ПроверитьВозможностьЗавершенияАукциона_СозданиеКоманды(пСткПараметры) Экспорт
	
	// 1. Заполнить параметры
	сткДанные = РегистрыСведений.Аук_ИсторияКомандАукционов.БазовыеПараметрыДляСозданияКоманд();
	
	ЗаполнитьЗначенияСвойств(сткДанные, пСткПараметры);
	
	сткПараметрыДанныхJSON = Новый Структура;
	сткПараметрыДанныхJSON.Вставить("Аукцион",				пСткПараметры.Аукцион);
	сткПараметрыДанныхJSON.Вставить("Команда",				пСткПараметры.Команда);
	
	сткДанные.Вставить("Данные",			ПроверкаВозможностиЗавершенияАукциона_ДанныеСтрокой(сткПараметрыДанныхJSON)); 
	
	// 2. Записать команду в БД
	РегистрыСведений.Аук_ИсторияКомандАукционов.ЗафиксироватьКомандуДляВыполнения_(сткДанные);
	
КонецПроцедуры

// Создание команды "Начать аукцион" 
//
// Параметры:
//  пСткПараметры	
//		*Аукцион			- Справочник.Аук_Аукционы 
//		*Автоматическая 	- Булево - признак интеративной отправки
//
Процедура НачатьАукцион_СозданиеКоманды(пСткПараметры) Экспорт
	
	// 1. Заполнить параметры
	сткДанные = РегистрыСведений.Аук_ИсторияКомандАукционов.БазовыеПараметрыДляСозданияКоманд();
	
	ЗаполнитьЗначенияСвойств(сткДанные, пСткПараметры);
	
	сткДанные.Команда = ПредопределенноеЗначение("Перечисление.Аук_Команды.НачатьАукцион");
	
	сткПараметрыДанныхJSON = Новый Структура;
	сткПараметрыДанныхJSON.Вставить("Аукцион",		пСткПараметры.Аукцион);
	сткПараметрыДанныхJSON.Вставить("Команда",		ПредопределенноеЗначение("Перечисление.Аук_Команды.НачатьАукцион"));
	
	сткДанные.Вставить("Данные",			НачатьАукцион_ДанныеСтрокой(сткПараметрыДанныхJSON)); 
	
	// 2. Записать команды в БД
	РегистрыСведений.Аук_ИсторияКомандАукционов.ЗафиксироватьКомандуДляВыполнения_(сткДанные);
	
	пСткПараметры.Вставить("КлючКоманды", сткДанные.КлючКоманды);
КонецПроцедуры

// Создание команды "Служебное оповещение" 
//
// Параметры:
//  пСткПараметры	
//		*Аукцион			- Справочник.Аук_Аукционы 
//		*Автоматическая 	- Булево - признак интеративной отправки
//
Процедура СлужебноеОповещение_СозданиеКоманды(пСткПараметры) Экспорт
	
	масОтветственные = Справочники.Аук_Аукционы.ОтветственныеЛицаПоАукциону(пСткПараметры.Аукцион);
	
	тзЭлПочтаОтветственных = Справочники.УБД_Пользователи.ЭлПочтаПользователя(масОтветственные);
	
	Для Каждого ЭлОтветственный Из масОтветственные Цикл	
		СтрокаТз = тзЭлПочтаОтветственных.Найти(ЭлОтветственный, "Пользователь");
		
		Если СтрокаТз <> Неопределено Тогда	
			// 1. Заполнить параметры
			сткДанные = РегистрыСведений.Аук_ИсторияКомандАукционов.БазовыеПараметрыДляСозданияКоманд();
			
			ЗаполнитьЗначенияСвойств(сткДанные, пСткПараметры);
			
			сткДанные.Команда = ПредопределенноеЗначение("Перечисление.Аук_Команды.ВыполнитьСлужебноеОповещение");
			
			масПолучатели = Новый Массив;
			масПолучатели.Добавить(СтрокаТз.ЭлПочта);
			
			сткПараметрыДанныхJSON = Новый Структура;
			сткПараметрыДанныхJSON.Вставить("Аукцион",			пСткПараметры.Аукцион);
			сткПараметрыДанныхJSON.Вставить("Команда",			ПредопределенноеЗначение("Перечисление.Аук_Команды.ВыполнитьСлужебноеОповещение"));
			сткПараметрыДанныхJSON.Вставить("НастройкиПисьма",	пСткПараметры.НастройкиПисьма);
			сткПараметрыДанныхJSON.Вставить("Получатели",		масПолучатели);
			
			сткДанные.Вставить("Данные",			СлужебноеОповещение_ДанныеСтрокой(сткПараметрыДанныхJSON)); 
			
			// 2. Записать команды в БД
			РегистрыСведений.Аук_ИсторияКомандАукционов.ЗафиксироватьКомандуДляВыполнения_(сткДанные);	
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры

// Отправка сообщений участникам. Создание команд по списку контаткных лиц.
//
// Параметры:
//  пСткПараметры
//	  Обязательные:	
//		*Аукцион			- Справочник.Аук_Аукционы 
//		*Автоматическая 	- Булево - признак интеративной отправки
//		*НомерЭтапа 		- Число
//		*СообщенияУчастникам 	- Массив соответствий
//			**Участник			- Справочник.Аук_УчастникиАукционов
//			**КонтактноеЛицо	- Справочник.Аук_КонтактныеЛицаУчастниковАукционов
//			**ТекстСообщения	- Строка 
//			**ТемаСообщения		- Строка
//			**Канал				- Справочник.Аук_КаналыВзаимодействия
//			**НастройкиКанала	- Массив настроек
//	  Опциональные:
//		*КлючРодителя		- Справочник.УБД_КлючиУникальности
//		*СтрокаДанных		- Число
//
Процедура ОтправитьСообщенияУчастникам_СозданиеКоманд_(пСткПараметры) Экспорт
	
	пСткПараметры.Вставить("КлючиКоманд", Новый Массив);
	
	Для Каждого СткДанныеСообщения Из пСткПараметры.СообщенияУчастникам Цикл	
		сткДанные	= РегистрыСведений.Аук_ИсторияКомандАукционов.БазовыеПараметрыДляСозданияКоманд();
		
		ЗаполнитьЗначенияСвойств(сткДанные, пСткПараметры); 
				
		сткДанные.Команда			= ПредопределенноеЗначение("Перечисление.Аук_Команды.ОтправитьСообщениеУчастнику");
		сткДанные.Вставить("Участник",			СткДанныеСообщения.Участник);
		сткДанные.Вставить("КонтактноеЛицо",	СткДанныеСообщения.КонтактноеЛицо);
			
		сткПараметрыДанныхJSON = Новый Структура;
		сткПараметрыДанныхJSON.Вставить("Аукцион",			пСткПараметры.Аукцион);
		сткПараметрыДанныхJSON.Вставить("НомерЭтапа",		пСткПараметры.НомерЭтапа);
		сткПараметрыДанныхJSON.Вставить("Период",			сткДанные.Период);
		сткПараметрыДанныхJSON.Вставить("СтрокаДанных",		?(СткДанныеСообщения.Свойство("СтрокаДанных"), СткДанныеСообщения.СтрокаДанных, 0));
		сткПараметрыДанныхJSON.Вставить("Команда",			ПредопределенноеЗначение("Перечисление.Аук_Команды.ОтправитьСообщениеУчастнику"));
		сткПараметрыДанныхJSON.Вставить("Канал",			XMLСтрока(СткДанныеСообщения.Канал));
		сткПараметрыДанныхJSON.Вставить("НастройкиКанала",	СткДанныеСообщения.НастройкиКанала);	
		сткПараметрыДанныхJSON.Вставить("ТекстСообщения",	СткДанныеСообщения.ТекстСообщения);
		сткПараметрыДанныхJSON.Вставить("ТемаСообщения",	СткДанныеСообщения.ТемаСообщения);
		сткПараметрыДанныхJSON.Вставить("ЗначенияПараметровШаблонов",	СткДанныеСообщения.ЗначенияПараметровШаблонов);
		
		сткДанные.Вставить("Данные",			ОтправитьСообщениеУчастнику_ДанныеСтрокой_(сткПараметрыДанныхJSON)); 
		
		// 2. Записать команду в БД
		РегистрыСведений.Аук_ИсторияКомандАукционов.ЗафиксироватьКомандуДляВыполнения_(сткДанные);
		
		пСткПараметры.КлючиКоманд.Добавить(сткДанные.КлючКоманды);
	КонецЦикла;	
	
КонецПроцедуры

// Получение данных от участников (сообщения, ставки, отказы). Одиночная команда
//
// Параметры:
//  пСткПараметры
//	  Обязательные:
//		*Аукцион			- Справочник.Аук_Аукционы 
//		*КонтактноеЛицо		- Справочник.Аук_КонтактныеЛицаУчастниковАукционов 
//		*Участник			- Справочник.Аук_УчастникиАукционов
//		*Данные 			- Произвольно. Может быть текст (отказ, сообщение) или массив структур (ставка)
//		*Автоматическая 	- Булево - признак интеративной отправки
//		*ВидДанных 			- Перечисление.Аук_ВидыДанных
//		*ТребуетсяПодтверждение 	- Булево - признак необходимости оповещать участника о приеме от него данных
//	  Опциональные:
//		*ВидСообщения		- Перечисление.Аук_ВидыСообщенийУчастникам - вид сообщения, которое необходимо отправить участнику (обязательно если ТребуетсяПодтверждение = Истина)
// 
// Возвращаемое значение:
//   Массив - результаты создания команд по списку контактных лиц 
//
Процедура ПолучениеДанныхОтУчастника_СозданиеКоманды(пСткПараметры) Экспорт

	пСткПараметры.Вставить("КлючиКоманд", Новый Массив);
	
	// 1. Заполнение данных для создания команды	
	сткДанные = РегистрыСведений.Аук_ИсторияКомандАукционов.БазовыеПараметрыДляСозданияКоманд();
	
	ЗаполнитьЗначенияСвойств(сткДанные, пСткПараметры);
	
	сткДанные.Команда			= ПредопределенноеЗначение("Перечисление.Аук_Команды.ПолучениеДанныхОтУчастника"); 	
	сткДанные.Вставить("Участник",			пСткПараметры.Участник);
	сткДанные.Вставить("КонтактноеЛицо",	пСткПараметры.КонтактноеЛицо);
	
	сткПараметрыДанныхJSON = Новый Структура;
	сткПараметрыДанныхJSON.Вставить("Аукцион",					пСткПараметры.Аукцион);
	сткПараметрыДанныхJSON.Вставить("Команда",					ПредопределенноеЗначение("Перечисление.Аук_Команды.ПолучениеДанныхОтУчастника"));
	сткПараметрыДанныхJSON.Вставить("ВидДанных",				пСткПараметры.ВидДанных);
	сткПараметрыДанныхJSON.Вставить("Данные",					пСткПараметры.Данные);
	сткПараметрыДанныхJSON.Вставить("ТребуетсяПодтверждение",	?(пСткПараметры.Свойство("ТребуетсяПодтверждение"), пСткПараметры.ТребуетсяПодтверждение, Ложь));
	сткПараметрыДанныхJSON.Вставить("ВидСообщенияУчастнику",	?(пСткПараметры.Свойство("ВидСообщения"), пСткПараметры.ВидСообщения,
																	ПредопределенноеЗначение("Перечисление.Аук_ВидыСообщенийУчастникам.ПростоеСообщение")));
	
	сткДанные.Вставить("Данные",			ПолучениеДанныхОтУчастника_ДанныеСтрокой(сткПараметрыДанныхJSON)); 
	
	// 2. Записать команду в БД
	РегистрыСведений.Аук_ИсторияКомандАукционов.ЗафиксироватьКомандуДляВыполнения_(сткДанные);
	
	пСткПараметры.КлючиКоманд.Добавить(сткДанные.КлючКоманды);	
КонецПроцедуры

// Создание команды "Перевести аукцион на новый этап"
//
// Параметры:
//  пСткПараметры
//	  Обязательные:
//		*Аукцион			- Справочник.Аук_Аукционы 
//		*Автоматическая 	- Булево - признак интеративной отправки
//	  Опциональные:
//		*КлючРодителя		- Справочник.УБД_КлючиУникальности
// 
// Возвращаемое значение:
//   Структура
//		*Успех - Булево
//		*Результат - Произвольно. Если Успех = Ложь, то Результат - Строка - Описание ошибки
//								  Если Успех = Истина, то Результат - Справочник.УБД_КлючиУникальности  
//
Процедура ПеревестиНаСледующийЭтап_СозданиеКоманды(пСткПараметры) Экспорт
	// 1. Заполнить параметры
	сткДанные = РегистрыСведений.Аук_ИсторияКомандАукционов.БазовыеПараметрыДляСозданияКоманд();
	
	ЗаполнитьЗначенияСвойств(сткДанные, пСткПараметры); 
	
	сткДанные.Команда = ПредопределенноеЗначение("Перечисление.Аук_Команды.ПеревестиАукционНаСледующийЭтап"); 	
	
	сткПараметрыДанныхJSON = Новый Структура;
	сткПараметрыДанныхJSON.Вставить("Аукцион",		пСткПараметры.Аукцион);
	сткПараметрыДанныхJSON.Вставить("Команда",		ПредопределенноеЗначение("Перечисление.Аук_Команды.ПеревестиАукционНаСледующийЭтап"));
	
	сткДанные.Вставить("Данные",			ПеревестиНаСледующийЭтап_ДанныеСтрокой(сткПараметрыДанныхJSON)); 
	
	// 2. Записать команды в БД
	РегистрыСведений.Аук_ИсторияКомандАукционов.ЗафиксироватьКомандуДляВыполнения_(сткДанные);
	
	пСткПараметры.Вставить("КлючКоманды", сткДанные.КлючКоманды);
КонецПроцедуры	

// Создание команды "Фиксация промежуточных итогов аукциона"
//
// Параметры:
//  пСткПараметры
//	  Обязательные:
//		*ДатаСтавки			- Дата 
//		*Аукцион			- Справочник.Аук_Аукционы  
//		*Участник			- Справочник.Аук_УчастникиАукционов
//		*СтрокаДанных	 	- Число
//		*Автоматическая 	- Булево - признак интеративной отправки
//		*РезультатРасчета 	- Число
//		*ПредставлениеРезультатаРасчета 	- Строка
//	  Опциональные:
//		*КлючРодителя		- Справочник.УБД_КлючиУникальности
//
Процедура ЗафиксироватьПромежуточныеИтогиАукциона_СозданиеКоманды(пСткПараметры) Экспорт
	// 1. Заполнить параметры
	сткДанные = РегистрыСведений.Аук_ИсторияКомандАукционов.БазовыеПараметрыДляСозданияКоманд();
	
	ЗаполнитьЗначенияСвойств(сткДанные, пСткПараметры);
	
	сткДанные.Команда			= ПредопределенноеЗначение("Перечисление.Аук_Команды.ЗафиксироватьПромежуточныеИтогиАукциона");	
	
	сткПараметрыДанныхJSON = Новый Структура;
	сткПараметрыДанныхJSON.Вставить("Команда",			сткДанные.Команда);
	
	сткПараметрыДанныхJSON.Вставить("ДатаСтавки",		пСткПараметры.ДатаСтавки);
	сткПараметрыДанныхJSON.Вставить("Аукцион",			пСткПараметры.Аукцион);
	сткПараметрыДанныхJSON.Вставить("Участник",			пСткПараметры.Участник);
	сткПараметрыДанныхJSON.Вставить("СтрокаДанных", 	пСткПараметры.СтрокаДанных);
	
	сткПараметрыДанныхJSON.Вставить("НомерЭтапа",		РегистрыСведений.Аук_ИсторияСтатусовАукционов.ТекущееСостояниеАукциона(пСткПараметры.Аукцион).НомерЭтапа);
	сткПараметрыДанныхJSON.Вставить("РезультатРасчета",	пСткПараметры.РезультатРасчета);
	сткПараметрыДанныхJSON.Вставить("ПредставлениеРезультатаРасчета", пСткПараметры.ПредставлениеРезультатаРасчета);
	
	сткДанные.Вставить("Данные",			ЗафиксироватьПромежуточныеИтогиАукциона_ДанныеСтрокой(сткПараметрыДанныхJSON)); 
	
	// 2. Записать команды в БД
	РегистрыСведений.Аук_ИсторияКомандАукционов.ЗафиксироватьКомандуДляВыполнения_(сткДанные);
	
	пСткПараметры.Вставить("КлючКоманды", сткДанные.КлючКоманды);
КонецПроцедуры

// Фиксация окончательных итогов аукциона
//
// Параметры:
//  пСткПараметры
//	  Обязательные:
//		*Аукцион				- Справочник.Аук_Аукционы 
//		*Автоматическая 		- Булево - признак интеративной отправки
//		*ТолькоСохранить 		- Булево - только сохранить (возможно в интерактивном режиме) или сохранить и сделать рассылку участникам
//		*НачальныеУсловия		- Структура
//			**ОбщаяСумма		- Число
//			**ОбщийСрок			- Число
//		*ИтогиАукциона			- Массив стуктур
//			**Участник			- Справочник.Аук_УчастникиАукционов
//			**СтрокаДанных		- Число
//			**РаспределяемаяСумма	- Число
//			**ЭтоПобедитель		- Булево
//	  Опциональные:
//		*КлючРодителя			- Справочник.УБД_КлючиУникальности
//
Функция ЗавершитьАукцион_СозданиеКоманды(пСткПараметры) Экспорт
	// 1. Заполнить параметры
	сткДанные = РегистрыСведений.Аук_ИсторияКомандАукционов.БазовыеПараметрыДляСозданияКоманд();
	
	ЗаполнитьЗначенияСвойств(сткДанные, пСткПараметры);
	
	сткДанные.Команда			= ПредопределенноеЗначение("Перечисление.Аук_Команды.ЗавершитьАукцион");	
	
	сткПараметрыДанныхJSON = Новый Структура;
	сткПараметрыДанныхJSON.Вставить("Аукцион",			пСткПараметры.Аукцион);
	сткПараметрыДанныхJSON.Вставить("Команда",			ПредопределенноеЗначение("Перечисление.Аук_Команды.ЗавершитьАукцион"));
	сткПараметрыДанныхJSON.Вставить("ОбщаяСумма",		пСткПараметры.НачальныеУсловия.ОбщаяСумма);
	сткПараметрыДанныхJSON.Вставить("ОбщийСрок",		пСткПараметры.НачальныеУсловия.ОбщийСрок);
	сткПараметрыДанныхJSON.Вставить("ИтогиАукциона",	пСткПараметры.ИтогиАукциона);
	сткПараметрыДанныхJSON.Вставить("ТолькоСохранить",	?(пСткПараметры.Свойство("ТолькоСохранить"), пСткПараметры.ТолькоСохранить, Ложь));
	
	сткДанные.Вставить("Данные",			ЗавершитьАукцион_ДанныеСтрокой(сткПараметрыДанныхJSON)); 
	
	// 2. Записать команды в БД
	РегистрыСведений.Аук_ИсторияКомандАукционов.ЗафиксироватьКомандуДляВыполнения_(сткДанные);
	
	пСткПараметры.Вставить("КлючКоманды", сткДанные.КлючКоманды);
КонецФункции

Функция ПоместитьВАрхив_СозданиеКоманды(пСткПараметры) Экспорт
	// 1. Заполнить параметры
	сткДанные = РегистрыСведений.Аук_ИсторияКомандАукционов.БазовыеПараметрыДляСозданияКоманд();
	
	ЗаполнитьЗначенияСвойств(сткДанные, пСткПараметры);
	
	сткДанные.Команда			= ПредопределенноеЗначение("Перечисление.Аук_Команды.ПоместитьВАрхив"); 	
	
	сткПараметрыДанныхJSON = Новый Структура;
	сткПараметрыДанныхJSON.Вставить("Аукцион",			пСткПараметры.Аукцион);
	сткПараметрыДанныхJSON.Вставить("Команда",			ПредопределенноеЗначение("Перечисление.Аук_Команды.ПоместитьВАрхив"));
	
	сткДанные.Вставить("Данные",			ПоместитьВАрхив_ДанныеСтрокой(сткПараметрыДанныхJSON)); 
	
	// 2. Записать команды в БД
	РегистрыСведений.Аук_ИсторияКомандАукционов.ЗафиксироватьКомандуДляВыполнения_(сткДанные);
	
	пСткПараметры.Вставить("КлючКоманды", сткДанные.КлючКоманды);
КонецФункции

#КонецОбласти

#Область ФормированиеДанныхКомандыВФорматеJSON 

//
Функция ПроверкаВозможностиНачатьАукцион_ДанныеСтрокой(пСткПараметрыДанныхJSON)

	сткРезДанные = Аук_УправлениеАукционамиКлиентСервер.БазоваяСтруктураДанныхДляКоманды();
	
	сткРезДанные.command = Перечисления.Аук_Команды.ИмяКомандыДляЗаписиВJSONПоСсылке(пСткПараметрыДанныхJSON.Команда);
	сткРезДанные.auction = XMLСтрока(пСткПараметрыДанныхJSON.Аукцион);
	
	Возврат Аук_ОбщийКлиентСервер.СериализоватьВСтрокуJSON(сткРезДанные);
	
КонецФункции

//
Функция ПроверкаВозможностиПеревестиАукционНаСледующийЭтап_ДанныеСтрокой(пСткПараметрыДанныхJSON)

	сткРезДанные = Аук_УправлениеАукционамиКлиентСервер.БазоваяСтруктураДанныхДляКоманды();
	
	сткРезДанные.command = Перечисления.Аук_Команды.ИмяКомандыДляЗаписиВJSONПоСсылке(пСткПараметрыДанныхJSON.Команда);
	сткРезДанные.auction = XMLСтрока(пСткПараметрыДанныхJSON.Аукцион);
	
	Возврат Аук_ОбщийКлиентСервер.СериализоватьВСтрокуJSON(сткРезДанные);
	
КонецФункции

//
Функция ПроверкаВозможностиПодведенияПромежуточныхИтоговАукциона_ДанныеСтрокой(пСткПараметрыДанныхJSON)

	сткРезДанные = Аук_УправлениеАукционамиКлиентСервер.БазоваяСтруктураДанныхДляКоманды();
	
	сткРезДанные.command = Перечисления.Аук_Команды.ИмяКомандыДляЗаписиВJSONПоСсылке(пСткПараметрыДанныхJSON.Команда);
	сткРезДанные.auction = XMLСтрока(пСткПараметрыДанныхJSON.Аукцион);
	
	Возврат Аук_ОбщийКлиентСервер.СериализоватьВСтрокуJSON(сткРезДанные);
	
КонецФункции

//
Функция ПроверкаВозможностиЗавершенияАукциона_ДанныеСтрокой(пСткПараметрыДанныхJSON)

	сткРезДанные = Аук_УправлениеАукционамиКлиентСервер.БазоваяСтруктураДанныхДляКоманды();
	
	сткРезДанные.command = Перечисления.Аук_Команды.ИмяКомандыДляЗаписиВJSONПоСсылке(пСткПараметрыДанныхJSON.Команда);
	сткРезДанные.auction = XMLСтрока(пСткПараметрыДанныхJSON.Аукцион);
	
	Возврат Аук_ОбщийКлиентСервер.СериализоватьВСтрокуJSON(сткРезДанные);
	
КонецФункции

//
Функция НачатьАукцион_ДанныеСтрокой(пСткПараметрыДанныхJSON)

	сткРезДанные = Аук_УправлениеАукционамиКлиентСервер.БазоваяСтруктураДанныхДляКоманды();
	
	сткРезДанные.command = Перечисления.Аук_Команды.ИмяКомандыДляЗаписиВJSONПоСсылке(пСткПараметрыДанныхJSON.Команда);
	сткРезДанные.auction = XMLСтрока(пСткПараметрыДанныхJSON.Аукцион);
	
	Возврат Аук_ОбщийКлиентСервер.СериализоватьВСтрокуJSON(сткРезДанные);
	
КонецФункции

//
Функция ПеревестиНаСледующийЭтап_ДанныеСтрокой(пСткПараметрыДанныхJSON)

	сткРезДанные = Аук_УправлениеАукционамиКлиентСервер.БазоваяСтруктураДанныхДляКоманды();
	
	сткРезДанные.command = Перечисления.Аук_Команды.ИмяКомандыДляЗаписиВJSONПоСсылке(пСткПараметрыДанныхJSON.Команда);
	сткРезДанные.auction = XMLСтрока(пСткПараметрыДанныхJSON.Аукцион);
	
	Возврат Аук_ОбщийКлиентСервер.СериализоватьВСтрокуJSON(сткРезДанные);
	
КонецФункции

//
Функция ЗафиксироватьПромежуточныеИтогиАукциона_ДанныеСтрокой(пСткПараметрыДанныхJSON)

	сткРезДанные = Аук_УправлениеАукционамиКлиентСервер.РасширеннаяСтруктураДанныхДляКоманды();
	
	сткРезДанные.command = Перечисления.Аук_Команды.ИмяКомандыДляЗаписиВJSONПоСсылке(пСткПараметрыДанныхJSON.Команда);
	сткРезДанные.auction = XMLСтрока(пСткПараметрыДанныхJSON.Аукцион);
	
	// "Начинка" команды
	сткРезДанные.required_data = ЗафиксироватьПромежуточныеИтогиАукциона_ДанныеСтрокой_ОбязательныеДанные(пСткПараметрыДанныхJSON);
	
	Возврат Аук_ОбщийКлиентСервер.СериализоватьВСтрокуJSON(сткРезДанные);
	
КонецФункции

Функция ЗафиксироватьПромежуточныеИтогиАукциона_ДанныеСтрокой_ОбязательныеДанные(пСткПараметрыДанныхJSON)
	
	сткРезультат = Аук_ОбщийКлиентСервер.СтруктураПоМассивуИмен(
						Аук_УправлениеАукционамиКлиентСервер.ЗафиксироватьПромежуточныеИтогиАукциона_ОписаниеСтруктурыОбязательныхДанных());
	
	сткРезультат.bid_date		= пСткПараметрыДанныхJSON.ДатаСтавки;					
	сткРезультат.participant	= XMLСтрока(пСткПараметрыДанныхJSON.Участник);
	сткРезультат.data_element	= пСткПараметрыДанныхJSON.СтрокаДанных;

	сткРезультат.stage_number		= пСткПараметрыДанныхJSON.НомерЭтапа;
	сткРезультат.calculation_result	= пСткПараметрыДанныхJSON.РезультатРасчета;
	сткРезультат.calculation_result_view	= пСткПараметрыДанныхJSON.ПредставлениеРезультатаРасчета;
		
	Возврат сткРезультат;
	
КонецФункции

//
Функция СлужебноеОповещение_ДанныеСтрокой(пСткПараметрыДанныхJSON)

	сткРезДанные = Аук_УправлениеАукционамиКлиентСервер.РасширеннаяСтруктураДанныхДляКоманды();
	
	// Основные параметры
	сткРезДанные.command = Перечисления.Аук_Команды.ИмяКомандыДляЗаписиВJSONПоСсылке(пСткПараметрыДанныхJSON.Команда);
	сткРезДанные.auction = XMLСтрока(пСткПараметрыДанныхJSON.Аукцион);
	
	// "Начинка" команды
	сткРезДанные.required_data = СлужебноеОповещение_ДанныеСтрокой_ОбязательныеДанные(пСткПараметрыДанныхJSON);
	
	Возврат Аук_ОбщийКлиентСервер.СериализоватьВСтрокуJSON(сткРезДанные);
	
КонецФункции

Функция СлужебноеОповещение_ДанныеСтрокой_ОбязательныеДанные(пСткПараметрыДанныхJSON)
	
	сткРезультат = Аук_ОбщийКлиентСервер.СтруктураПоМассивуИмен(Аук_УправлениеАукционамиКлиентСервер.СлужебноеОповещение_ОписаниеСтруктурыОбязательныхДанных());
	
	сткРезультат.recipients	= пСткПараметрыДанныхJSON.Получатели;
	сткРезультат.subject	= пСткПараметрыДанныхJSON.НастройкиПисьма.ТемаПисьма;
	сткРезультат.message	= пСткПараметрыДанныхJSON.НастройкиПисьма.ТекстПисьма;
	
	Возврат сткРезультат;
	
КонецФункции

//
Функция ОтправитьСообщениеУчастнику_ДанныеСтрокой_(пСткПараметрыДанныхJSON)

	сткРезДанные = Аук_УправлениеАукционамиКлиентСервер.РасширеннаяСтруктураДанныхДляКоманды();
	
	// Основные параметры
	сткРезДанные.command = Перечисления.Аук_Команды.ИмяКомандыДляЗаписиВJSONПоСсылке(пСткПараметрыДанныхJSON.Команда);
	сткРезДанные.auction = XMLСтрока(пСткПараметрыДанныхJSON.Аукцион);
	
	// "Начинка" команды, текст оповещения и адресаты (сотрудники).
	сткРезДанные.required_data = ОтправитьСообщениеУчастнику_ДанныеСтрокой_ОбязательныеДанные_(пСткПараметрыДанныхJSON);
	
	Возврат Аук_ОбщийКлиентСервер.СериализоватьВСтрокуJSON(сткРезДанные);
	
КонецФункции

Функция ОтправитьСообщениеУчастнику_ДанныеСтрокой_ОбязательныеДанные_(пСткПараметрыДанныхJSON)

	сткРезультат = Аук_ОбщийКлиентСервер.СтруктураПоМассивуИмен(Аук_УправлениеАукционамиКлиентСервер.ОтправитьСообщениеУчастнику_ОписаниеСтруктурыОбязательныхДанных());
	
	сткРезультат.channel			= пСткПараметрыДанныхJSON.Канал;
	сткРезультат.channel_settings	= пСткПараметрыДанныхJSON.НастройкиКанала;
	сткРезультат.message			= пСткПараметрыДанныхJSON.ТекстСообщения;
	сткРезультат.subject			= пСткПараметрыДанныхJSON.ТемаСообщения;
	сткРезультат.period				= пСткПараметрыДанныхJSON.Период;
	сткРезультат.data_element		= пСткПараметрыДанныхJSON.СтрокаДанных;
	сткРезультат.template_parameter_values		= пСткПараметрыДанныхJSON.ЗначенияПараметровШаблонов;
	сткРезультат.stage_number		= пСткПараметрыДанныхJSON.НомерЭтапа;
	
	Возврат сткРезультат;
	
КонецФункции

//
Функция ПолучениеДанныхОтУчастника_ДанныеСтрокой(пСткПараметрыДанныхJSON)

	сткРезДанные = Аук_УправлениеАукционамиКлиентСервер.РасширеннаяСтруктураДанныхДляКоманды();
	
	// Основные параметры
	сткРезДанные.command = Перечисления.Аук_Команды.ИмяКомандыДляЗаписиВJSONПоСсылке(пСткПараметрыДанныхJSON.Команда);
	сткРезДанные.auction = XMLСтрока(пСткПараметрыДанныхJSON.Аукцион);
	
	// "Начинка" команды
	сткРезДанные.required_data = ПолучениеДанныхОтУчастника_ДанныеСтрокой_ОбязательныеДанные(пСткПараметрыДанныхJSON);
	
	Возврат Аук_ОбщийКлиентСервер.СериализоватьВСтрокуJSON(сткРезДанные);
	
КонецФункции

Функция ПолучениеДанныхОтУчастника_ДанныеСтрокой_ОбязательныеДанные(пСткПараметрыДанныхJSON)

	сткРезультат = Аук_ОбщийКлиентСервер.СтруктураПоМассивуИмен(Аук_УправлениеАукционамиКлиентСервер.ПолучениеДанныхОтУчастника_ОписаниеСтруктурыОбязательныхДанных());
	
	сткРезультат.data_type				= XMLСтрока(пСткПараметрыДанныхJSON.ВидДанных);
	сткРезультат.data					= пСткПараметрыДанныхJSON.Данные;
	сткРезультат.confirmation_required	= пСткПараметрыДанныхJSON.ТребуетсяПодтверждение;
	сткРезультат.message_type			= XMLСтрока(пСткПараметрыДанныхJSON.ВидСообщенияУчастнику);
	
	Возврат сткРезультат;
	
КонецФункции

//
Функция ЗавершитьАукцион_ДанныеСтрокой(пСткПараметрыДанныхJSON)

	сткРезДанные = Аук_УправлениеАукционамиКлиентСервер.РасширеннаяСтруктураДанныхДляКоманды();
	
	// Основные параметры
	сткРезДанные.command = Перечисления.Аук_Команды.ИмяКомандыДляЗаписиВJSONПоСсылке(пСткПараметрыДанныхJSON.Команда);
	сткРезДанные.auction = XMLСтрока(пСткПараметрыДанныхJSON.Аукцион);
	
	// "Начинка" команды
	сткРезДанные.required_data = ЗавершитьАукцион_ДанныеСтрокой_ОбязательныеДанные(пСткПараметрыДанныхJSON);
	
	Возврат Аук_ОбщийКлиентСервер.СериализоватьВСтрокуJSON(сткРезДанные);
	
КонецФункции

Функция ЗавершитьАукцион_ДанныеСтрокой_ОбязательныеДанные(пСткПараметрыДанныхJSON)

	сткРезультат = Аук_ОбщийКлиентСервер.СтруктураПоМассивуИмен(Аук_УправлениеАукционамиКлиентСервер.ЗавершитьАукцион_ОписаниеСтруктурыОбязательныхДанных());
	
	сткРезультат.total_amount		= пСткПараметрыДанныхJSON.ОбщаяСумма;
	сткРезультат.total_time			= пСткПараметрыДанныхJSON.ОбщийСрок;
	сткРезультат.auction_results	= пСткПараметрыДанныхJSON.ИтогиАукциона;
	сткРезультат.only_saving		= пСткПараметрыДанныхJSON.ТолькоСохранить;
	
	Возврат сткРезультат;
	
КонецФункции

//
Функция ПоместитьВАрхив_ДанныеСтрокой(пСткПараметрыДанныхJSON)

	сткРезДанные = Аук_УправлениеАукционамиКлиентСервер.РасширеннаяСтруктураДанныхДляКоманды();
	
	// Основные параметры
	сткРезДанные.command = Перечисления.Аук_Команды.ИмяКомандыДляЗаписиВJSONПоСсылке(пСткПараметрыДанныхJSON.Команда);
	сткРезДанные.auction = XMLСтрока(пСткПараметрыДанныхJSON.Аукцион);
	
	Возврат Аук_ОбщийКлиентСервер.СериализоватьВСтрокуJSON(сткРезДанные);
	
КонецФункции

#КонецОбласти

#Область ВыполнениеКоманд

// Ошибка данных -> фиксируем ошибку
// Ошибка записи -> уходим на 2 круг, логируем в грейлог
//
Функция ПроизвестиКонтрольДанныхИВыполнитьКоманду(пСткДанныеКоманды) Экспорт
	
	сткВозврат = Новый Структура;
	
	сткВозврат.Вставить("Успех",		Истина);
	сткВозврат.Вставить("КлючКоманды",	пСткДанныеКоманды.КлючКоманды); 
	сткВозврат.Вставить("Результат",	ПредопределенноеЗначение("Перечисление.Аук_РезультатыВыполненияКоманд.ОбработанаУспешно"));
	сткВозврат.Вставить("Комментарий",	"");
	
	НачатьТранзакцию();
	Попытка
		ПроверитьДанныеКомандыПередВыполнением(пСткДанныеКоманды, сткВозврат); // Здесь может быть ошибка данных -> Фиксируем ошибку выполнения команды
		
		Если Не сткВозврат.Успех Тогда
			РегистрыСведений.Аук_ИсторияКомандАукционов.ЗафиксироватьРезультатВыполненияКомандыПоКлючу(сткВозврат);
			
			ЗафиксироватьТранзакцию();
			
			Аук_ОбщийКлиентСервер.ОтправитьСообщениеВГрейлог(сткВозврат.Комментарий, "ПроизвестиКонтрольДанныхИВыполнитьКоманду");
			
			Возврат ЭдоОбщий._Ошибка(сткВозврат.Комментарий);
		Иначе			
			ПроизвестиВыполнениеКоманды(пСткДанныеКоманды, сткВозврат);
			
			РегистрыСведений.Аук_ИсторияКомандАукционов.ЗафиксироватьРезультатВыполненияКомандыПоКлючу(сткВозврат);
			
			ЗафиксироватьТранзакцию();
			
			Если Не сткВозврат.Успех Тогда
				Аук_ОбщийКлиентСервер.ОтправитьСообщениеВГрейлог(сткВозврат.Комментарий, "ПроизвестиКонтрольДанныхИВыполнитьКоманду");
				
				Возврат ЭдоОбщий._Ошибка(сткВозврат.Комментарий);	
			Иначе
				Возврат ЭдоОбщий._Успех(пСткДанныеКоманды.КлючКоманды);	
			КонецЕсли;	
		
		КонецЕсли;
	Исключение
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		
		стрОшибка = ОписаниеОшибки();
		
		сткВозврат.Успех		= Ложь;
		сткВозврат.Результат	= ПредопределенноеЗначение("Перечисление.Аук_РезультатыВыполненияКоманд.ОбработанаСОшибкой");
		сткВозврат.Комментарий	= стрОшибка;
		
		РегистрыСведений.Аук_ИсторияКомандАукционов.ЗафиксироватьРезультатВыполненияКомандыПоКлючу(сткВозврат);
		
		Аук_ОбщийКлиентСервер.ОтправитьСообщениеВГрейлог(стрОшибка, "ПроизвестиКонтрольДанныхИВыполнитьКоманду");
		
		Возврат ЭдоОбщий._Ошибка(стрОшибка);
	КонецПопытки;
	
КонецФункции

Процедура ПроверитьДанныеКомандыПередВыполнением(пСткДанныеКоманды, пСткВозврат)
	
	// 1. Валидация JSONа команды, проверка наличия необходимых данных
	сткРез = ВыполнитьПроверкуДанныхКомандыИзСтрокиJSON(пСткДанныеКоманды.Данные);
	
	Если Не сткРез.Успех Тогда	
		пСткВозврат.Успех		= Ложь;
		пСткВозврат.КлючКоманды	= пСткДанныеКоманды.КлючКоманды;
		пСткВозврат.Результат	= ПредопределенноеЗначение("Перечисление.Аук_РезультатыВыполненияКоманд.ОшибкаВалидацииДанных");
		пСткВозврат.Комментарий	= сткРез.Результат;
		
		Возврат;
	КонецЕсли;	
	
	пСткДанныеКоманды.Вставить("ДанныеКоманды", сткРез.Результат);
	
	// 2. Соответствие данных команды с данными базы
	сткРез = ПроверитьСоответсвиеДанныхКомандыСДаннымиБазы(пСткДанныеКоманды.ДанныеКоманды);
	
	Если Не сткРез.Успех Тогда
		пСткВозврат.Успех		= Ложь;
		пСткВозврат.КлючКоманды	= пСткДанныеКоманды.КлючКоманды;
		пСткВозврат.Результат	= ПредопределенноеЗначение("Перечисление.Аук_РезультатыВыполненияКоманд.ОшибкаСопоставленияДанных");
		пСткВозврат.Комментарий	= сткРез.Результат;
		
		Возврат;
	КонецЕсли;
	
	пСткДанныеКоманды.Вставить("Аукцион", пСткДанныеКоманды.ДанныеКоманды.auction);
	пСткДанныеКоманды.Вставить("Команда", пСткДанныеКоманды.ДанныеКоманды.command);
	
	// 3. Проверка возможности выполнения команды, допустимость применения в зависимости от команды
	сткРез = ПроверитьВозможностьВыполненияКомандыПоАукциону(пСткДанныеКоманды);
	
	Если Не сткРез.Успех Тогда
		пСткВозврат.Успех		= Ложь;
		пСткВозврат.КлючКоманды	= пСткДанныеКоманды.КлючКоманды;
		пСткВозврат.Результат	= ПредопределенноеЗначение("Перечисление.Аук_РезультатыВыполненияКоманд.НеприменимоКТекущемуСостоянию");
		пСткВозврат.Комментарий	= сткРез.Результат;
		
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроизвестиВыполнениеКоманды(пСткДанныеКоманды, пСткВозврат)
	
	//Попытка
		Если пСткДанныеКоманды.Команда = "CheckPossibilityOfStartingAuction" Тогда
			
			ПроверитьВозможностьНачалаАукциона_Реализация(пСткДанныеКоманды, пСткВозврат);
			
		ИначеЕсли пСткДанныеКоманды.Команда = "ServiceNotification" Тогда
			
			СлужебноеОповещение_Реализация(пСткДанныеКоманды, пСткВозврат);
			
		ИначеЕсли пСткДанныеКоманды.Команда = "StartAuction" Тогда	
			
			НачатьАукцион_Реализация(пСткДанныеКоманды, пСткВозврат);
			
		ИначеЕсли пСткДанныеКоманды.Команда = "SendMessageToAuctionParticipant" Тогда	
			
			ОтправитьСообщениеУчастнику_Реализация(пСткДанныеКоманды, пСткВозврат);
			
		ИначеЕсли пСткДанныеКоманды.Команда = "GetDataFromParticipant" Тогда	
			
			ПолучениеДанныхОтУчастника_Реализация(пСткДанныеКоманды, пСткВозврат);
			
		ИначеЕсли пСткДанныеКоманды.Команда = "CheckPossibilityOfMovingAuctionToNextStage" Тогда	
			
			ПроверитьВозможностиПеревестиАукционНаСледующийЭтап_Реализация(пСткДанныеКоманды, пСткВозврат);
			
		ИначеЕсли пСткДанныеКоманды.Команда = "MoveAuctionToNextStage" Тогда	
			
			ПеревестиАукционНаСледующийЭтап_Реализация(пСткДанныеКоманды, пСткВозврат);
			
		ИначеЕсли пСткДанныеКоманды.Команда = "CheckPossibilityOfSummingInterimResults" Тогда	
			
			ПроверитьВозможностиПодведенияПромежуточныхИтоговАукциона_Реализация(пСткДанныеКоманды, пСткВозврат);
			
		ИначеЕсли пСткДанныеКоманды.Команда = "FixTempResultsOfAuction" Тогда	
			
			ЗафиксироватьПромежуточныеИтогиАукциона_Реализация(пСткДанныеКоманды, пСткВозврат);
			
		ИначеЕсли пСткДанныеКоманды.Команда = "CheckPossibilityOfCompletingAuction" Тогда	
			
			ПроверкаВозможностиЗавершенияАукциона_Реализация(пСткДанныеКоманды, пСткВозврат);
			
		ИначеЕсли пСткДанныеКоманды.Команда = "CompletingAuction" Тогда	
			
			ЗавершитьАукцион_Реализация(пСткДанныеКоманды, пСткВозврат);
			
		ИначеЕсли пСткДанныеКоманды.Команда = "PutInArchive" Тогда	
			
			ПоместитьВАрхив_Реализация(пСткДанныеКоманды, пСткВозврат);	
			
		Иначе	
			пСткВозврат.Успех		= Ложь;
			пСткВозврат.Результат	= ПредопределенноеЗначение("Перечисление.Аук_РезультатыВыполненияКоманд.ОбработанаСОшибкой");
			пСткВозврат.Комментарий = СтрШаблон(НСтр("ru = 'Для команды <%1> не реализован обработчик'"), пСткДанныеКоманды.Команда);
			//ВызватьИсключение СтрШаблон(НСтр("ru = 'Для команды <%1> не реализован обработчик'"), пСткДанныеКоманды.Команда);	
		КонецЕсли;
	//Исключение
	//	стрОшибка = ОписаниеОшибки();
	//	
	//	пСткВозврат.Успех		= Ложь;
	//	пСткВозврат.Результат	= ПредопределенноеЗначение("Перечисление.Аук_РезультатыВыполненияКоманд.ОбработанаСОшибкой");
	//	пСткВозврат.Комментарий = стрОшибка;	
	//КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

Процедура ПроверитьВозможностьНачалаАукциона_Реализация(пСткДанныеКоманды, пСткВозврат)
	
	сткПараметры = РегистрыСведений.Аук_ИсторияКомандАукционов.БазовыеПараметрыДляСозданияКоманд();
	
	сткПараметры.Автоматическая	= пСткДанныеКоманды.Автоматическая;
	сткПараметры.Аукцион		= пСткДанныеКоманды.Аукцион;
	сткПараметры.КлючРодителя	= пСткДанныеКоманды.КлючКоманды;// создание дочерней команды
	
	// 1. Получение значения флага "Автоматический старт"
	сткНастройки = Справочники.Аук_Аукционы.НастройкиАвтоматическогоВыполненияАукциона(пСткДанныеКоманды.Аукцион);
	
	Если сткНастройки.АвтоматическийСтарт Тогда // 2.1 Если автоматическй старт разрешен -> создаем команду "Начать аукцион"	
		НачатьАукцион_СозданиеКоманды(сткПараметры);
		
	Иначе // 2.2 Если автоматический старт запрещен -> информируем авторов (создаем команду "технического" информирования)	
		сткПараметры.Вставить("НастройкиПисьма", ПроверитьВозможностьНачалаАукциона_НастройкаОповещения(сткПараметры));
		
		СлужебноеОповещение_СозданиеКоманды(сткПараметры);	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьВозможностиПеревестиАукционНаСледующийЭтап_Реализация(пСткДанныеКоманды, пСткВозврат)
	
	сткПараметры = РегистрыСведений.Аук_ИсторияКомандАукционов.БазовыеПараметрыДляСозданияКоманд();
	
	сткПараметры.Автоматическая	= пСткДанныеКоманды.Автоматическая;
	сткПараметры.Аукцион		= пСткДанныеКоманды.Аукцион;
	сткПараметры.КлючРодителя	= пСткДанныеКоманды.КлючКоманды; // создание дочерней команды
	
	// 1. Получение значения флага "Автоматический старт"
	сткНастройки = Справочники.Аук_Аукционы.НастройкиАвтоматическогоВыполненияАукциона(пСткДанныеКоманды.Аукцион);
	
	Если сткНастройки.АвтоматическийПереходПоЭтапам Тогда // 2.1 Если автоматическй переход разрешен -> создаем команду "Перейти на следующий этап"
		
		ПеревестиНаСледующийЭтап_СозданиеКоманды(сткПараметры);	
	Иначе // 2.2 Если автоматический переход запрещен -> информируем авторов (создаем команду "технического" информирования)
		
		сткПараметры.Вставить("НастройкиПисьма", ПроверитьВозможностиПеревестиАукционНаСледующийЭтап_НастройкиПисьма(сткПараметры));
		
		СлужебноеОповещение_СозданиеКоманды(сткПараметры);	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьВозможностиПодведенияПромежуточныхИтоговАукциона_Реализация(пСткДанныеКоманды, пСткВозврат)
	
	сткПараметры = РегистрыСведений.Аук_ИсторияКомандАукционов.БазовыеПараметрыДляСозданияКоманд();
	
	сткПараметры.Автоматическая	= пСткДанныеКоманды.Автоматическая;
	сткПараметры.Аукцион		= пСткДанныеКоманды.Аукцион;
	сткПараметры.КлючРодителя	= пСткДанныеКоманды.КлючКоманды;// создание дочерней команды
	
	// 1. Получение значения флага "Автоматический старт"
	сткНастройки = Справочники.Аук_Аукционы.НастройкиАвтоматическогоВыполненияАукциона(пСткДанныеКоманды.Аукцион);
	
	Если сткНастройки.АвтоматическоеПодведениеПромежуточныхИтогов Тогда // 2.1 Если автоматическй старт разрешен -> создаем команду "Подвести промежуточные итоги"
		// В параметры команды нужно поместить данные лидирующей ставки
		сткПромежуточныйИтог = Аук_ОбщийСервер.ПромежуточныйИтогДанныеЛидирующейСтавки(пСткДанныеКоманды.Аукцион);
		
		Если сткПромежуточныйИтог.Успех Тогда
			
			Если ЗначениеЗаполнено(сткПромежуточныйИтог.Результат) Тогда
				сткЛидирующаяСтавка = сткПромежуточныйИтог.Результат;
				
				сткПараметры.Вставить("ДатаСтавки",			сткЛидирующаяСтавка.ДатаСтавки);
				сткПараметры.Вставить("Участник",			сткЛидирующаяСтавка.Участник);
				сткПараметры.Вставить("СтрокаДанных",		сткЛидирующаяСтавка.СтрокаДанных);
				//сткПараметры.Вставить("НомерЭтапа",			сткЛидирующаяСтавка.НомерЭтапа);
				
				сткПараметры.Вставить("РезультатРасчета",	сткЛидирующаяСтавка.РезультатРасчета);
				сткПараметры.Вставить("ПредставлениеРезультатаРасчета",	сткЛидирующаяСтавка.ПредставлениеРезультатаРасчета);
					
				ЗафиксироватьПромежуточныеИтогиАукциона_СозданиеКоманды(сткПараметры);	
			Иначе		
				// Если данных ставки нет, то просто создать команду перевода на новый этап
				ПеревестиНаСледующийЭтап_СозданиеКоманды(сткПараметры);
				
			КонецЕсли;	
			
		Иначе
			пСткВозврат.Успех		= Ложь;
			пСткВозврат.Результат	= ПредопределенноеЗначение("Перечисление.Аук_РезультатыВыполненияКоманд.ОбработанаСОшибкой");
			пСткВозврат.Успех		= сткПромежуточныйИтог.Результат;
		КонецЕсли;	
		
	Иначе // 2.2 Если автоматический старт запрещен -> информируем авторов (создаем команду "технического" информирования)
		
		сткПараметры.Вставить("НастройкиПисьма", ПроверитьВозможностьПодведенияПромежуточныхИтоговАукциона_НастройкиПисьма(сткПараметры));
		
		СлужебноеОповещение_СозданиеКоманды(сткПараметры);	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверкаВозможностиЗавершенияАукциона_Реализация(пСткДанныеКоманды, пСткВозврат)
	
	сткПараметры = РегистрыСведений.Аук_ИсторияКомандАукционов.БазовыеПараметрыДляСозданияКоманд();
	
	сткПараметры.Автоматическая	= пСткДанныеКоманды.Автоматическая;
	сткПараметры.Аукцион		= пСткДанныеКоманды.Аукцион;
	сткПараметры.КлючРодителя	= пСткДанныеКоманды.КлючКоманды;// создание дочерней команды
	
	// 1. Получение значения флага "Автоматический старт"
	сткНастройки = Справочники.Аук_Аукционы.НастройкиАвтоматическогоВыполненияАукциона(пСткДанныеКоманды.Аукцион);
	
	Если сткНастройки.АвтоматическоеПодведениеОкончательныхИтогов Тогда // 2.1 Если автоматическй старт разрешен -> создаем команду "Завершить аукцион"
		// сделать расчет
		сткПараметрыРасчета = Новый Структура;
		
		сткПараметрыРасчета.Вставить("Аукцион",					пСткДанныеКоманды.Аукцион);
		сткПараметрыРасчета.Вставить("ВидАукциона",				Справочники.Аук_Аукционы.КлючевыеДанныеАукциона(пСткДанныеКоманды.Аукцион).ВидАукциона);
		// по идее вряд ли может быть такое, что при АвтоматическоеПодведениеОкончательныхИтогов = Истина, СРаспределениемСуммы будет равно Ложь
		сткПараметрыРасчета.Вставить("СРаспределениемСуммы",	Истина);  
		
		Аук_ОбщийСервер.ОкончательныеИтоги_ДополнительныеПараметры(сткПараметрыРасчета); 
		
		сткПараметры.Вставить("ИтогиАукциона",	Аук_ОбщийСервер.ОкончательныеИтогиАукциона(сткПараметрыРасчета));
		
		// сфомировать данные "шапки" (ОбщаяСумма, ОбщийСрок)
		сткПараметры.Вставить("НачальныеУсловия", Аук_ОбщийСервер.НачальныеУсловияАукциона(сткПараметры.Аукцион));
		
		ЗавершитьАукцион_СозданиеКоманды(сткПараметры);
		
	Иначе // 2.2 Если автоматический старт запрещен -> информируем авторов (создаем команду "технического" информирования)
		
		сткПараметры.Вставить("НастройкиПисьма", ПроверитьВозможностьЗавершенияАукциона_НастройкиПисьма(сткПараметры));
		
		СлужебноеОповещение_СозданиеКоманды(сткПараметры);
	КонецЕсли;
	
КонецПроцедуры

Процедура СлужебноеОповещение_Реализация(пСткДанныеКоманды, пСткВозврат)
	
	сткДопДанныеКоманды = пСткДанныеКоманды.ДанныеКоманды.required_data;
	
	сткПараметрыПисьма = Справочники.Аук_КаналыВзаимодействия.ОтправитьСообщениеВКанал_ПочтовыйНеавтоматический_Параметры();
	
	сткПараметрыПисьма.Тема			= сткДопДанныеКоманды.subject;
	сткПараметрыПисьма.Текст		= сткДопДанныеКоманды.message;	
	сткПараметрыПисьма.Получатели	= сткДопДанныеКоманды.recipients;
	
	сткРез = Справочники.Аук_КаналыВзаимодействия.ОтправитьСообщениеВКанал_ПочтовыйНеавтоматический(сткПараметрыПисьма);
	
	Если Не сткРез.Успех Тогда
		пСткВозврат.Успех		= Ложь;
		пСткВозврат.Результат	= ПредопределенноеЗначение("Перечисление.Аук_РезультатыВыполненияКоманд.ОбработанаСОшибкой");
		пСткВозврат.Комментарий	= сткРез.Результат;	
	КонецЕсли;
	
КонецПроцедуры	

Процедура НачатьАукцион_Реализация(пСткДанныеКоманды, пСткВозврат)		
	// Порядок важен!!!
	
	// 1. Создать команды оповещения участникам победителям
	сткПараметры = Новый Структура;
	
	сткПараметры.Вставить("Аукцион",				пСткДанныеКоманды.Аукцион);
	сткПараметры.Вставить("Автоматическая", 		пСткДанныеКоманды.Автоматическая);
	сткПараметры.Вставить("КлючРодителя",			пСткДанныеКоманды.КлючКоманды);
	сткПараметры.Вставить("НомерЭтапа",				0);
	
	сткПараметры.Вставить("СообщенияУчастникам",	НачатьАукцион_ДанныеРассылки(пСткДанныеКоманды));
	
	ОтправитьСообщенияУчастникам_СозданиеКоманд_(сткПараметры);
	
	// 2. Зафиксировать изменение статуса
	Аук_ОбщийСервер.ПеревестиНовыйАукционВРаботу_(пСткДанныеКоманды.Аукцион);
	
	// 3. Если команда автоматическая то сделаем служебную рассылку сотрудникам
	Если пСткДанныеКоманды.Автоматическая Тогда 
		сткПараметры.Вставить("НастройкиПисьма", НачалоАукциона_НастройкаОповещения(сткПараметры));
		
		СлужебноеОповещение_СозданиеКоманды(сткПараметры);
	КонецЕсли;
КонецПроцедуры

Функция НачатьАукцион_ДанныеРассылки(пСткДанныеКоманды)
	// 1. Участники
	масУчастники = Справочники.Аук_Аукционы.УчастникиАукциона(пСткДанныеКоманды.Аукцион);
	
	тзКонтактныеЛицаУчастников = Справочники.Аук_Аукционы.КонтактныеЛицаСПривязкойКУчастникам(пСткДанныеКоманды.Аукцион);
	
	масКонтактныеЛица = тзКонтактныеЛицаУчастников.ВыгрузитьКолонку("КонтактноеЛицо");
	
	// 2. Канал взаимодействия + настройки
	сооРез = Справочники.Аук_КонтактныеЛицаУчастниковАукционов.ТекущиеКонтактныеДанныеКонтактныхЛиц(масКонтактныеЛица);
	
	// 3. Получаем шаблон из РС Аук_ШаблоныСообщенийУчастникам
	сткОтбор = Новый Структура;
	сткОтбор.Вставить("ВидСообщения",	ПредопределенноеЗначение("Перечисление.Аук_ВидыСообщенийУчастникам.УведомлениеУчастникаОНачалеАукциона"));
	сткОтбор.Вставить("ВидАукциона",	Справочники.Аук_Аукционы.КлючевыеДанныеАукциона(пСткДанныеКоманды.Аукцион).ВидАукциона);
	сткОтбор.Вставить("Участники",		масУчастники);
	
	/////////////////////
	сооШаблоныСообщений = РегистрыСведений.Аук_ШаблоныСообщенийУчастникам.ШаблонСообщенияПоОтбору(сткОтбор);
	
	масПараметры = Новый Массив;
	сооПараметрыСообщений = Новый Соответствие;
	Для Каждого СткЭлСоо Из сооШаблоныСообщений Цикл
		масПараметрыШаблонов = Аук_ОбщийВызовСервера.СтрокаНайтиВсеПоРегулярномуВыражениюТолькоЗначения(СткЭлСоо.Значение.Шаблон + " " + СткЭлСоо.Значение.Заголовок,
																					Аук_ОбщийКлиентСервер.Шаблон_ПараметрыШаблонаСообщения(),,, Истина);
																					
		сооПараметрыСообщений.Вставить(СткЭлСоо.Ключ, масПараметрыШаблонов);																			
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(масПараметры, масПараметрыШаблонов, Истина); 
	КонецЦикла;
	
	сткПараметрыШаблонов = Новый Структура;
	сткПараметрыШаблонов.Вставить("Аукцион", пСткДанныеКоманды.Аукцион);
	
	сооЗначенияПараметровШаблонов = Аук_ОбщийСервер.ЗначенияПараметровШаблонов(масПараметрыШаблонов, сткПараметрыШаблонов);
	////////////////////
		
	масРезультат = Новый Массив;
	Для Каждого ЭлУчастник Из масУчастники Цикл
		масСтрокиТзУчастники = тзКонтактныеЛицаУчастников.НайтиСтроки(Новый Структура("Участник", ЭлУчастник));
		
		Для Сч_ = 0 По масСтрокиТзУчастники.ВГраница() Цикл
			
			сткДанныеСообщения = Новый Структура;
			
			сткДанныеСообщения.Вставить("Участник",			ЭлУчастник);
			сткДанныеСообщения.Вставить("КонтактноеЛицо",	масСтрокиТзУчастники[Сч_].КонтактноеЛицо);
			сткДанныеСообщения.Вставить("СтрокаДанных",		Сч_);
			
			Если сооШаблоныСообщений <> Неопределено Тогда
				сткНастройкиСообщения = сооШаблоныСообщений.Получить(ЭлУчастник);
				
				сткДанныеСообщения.Вставить("ТекстСообщения",	сткНастройкиСообщения.Шаблон);
				сткДанныеСообщения.Вставить("ТемаСообщения",	сткНастройкиСообщения.Заголовок);
				
				масПараметрыШаблонов = сооПараметрыСообщений.Получить(ЭлУчастник);
				
				масРез = Новый Массив;
				Для Каждого ЭлМас Из масПараметрыШаблонов Цикл
					масРез.Добавить(Новый Структура("NameParam, ValueParam", ЭлМас, сооЗначенияПараметровШаблонов.Получить(ЭлМас)));	
				КонецЦикла;	
				сткДанныеСообщения.Вставить("ЗначенияПараметровШаблонов", масРез);
				
			Иначе
				сткДанныеСообщения.Вставить("ТекстСообщения",	Неопределено);
				сткДанныеСообщения.Вставить("ТемаСообщения",	Неопределено);
				сткДанныеСообщения.Вставить("ЗначенияПараметровШаблонов", Неопределено);
			КонецЕсли;	
				
			сткДанныеКанала = сооРез.Получить(масСтрокиТзУчастники[Сч_].КонтактноеЛицо);
			
			Если сткДанныеКанала <> Неопределено Тогда
				сткДанныеСообщения.Вставить("Канал",			сткДанныеКанала.КаналВзаимодействия);
				сткДанныеСообщения.Вставить("НастройкиКанала",	сткДанныеКанала.НастройкиКаналаВзаимодействия);
			Иначе
				сткДанныеСообщения.Вставить("Канал",			Неопределено);
				сткДанныеСообщения.Вставить("НастройкиКанала",	Неопределено);
			КонецЕсли;	
			
			масРезультат.Добавить(сткДанныеСообщения);
			
		КонецЦикла;	
	КонецЦикла;
	
	Возврат масРезультат;
	
КонецФункции

Процедура ОтправитьСообщениеУчастнику_Реализация(пСткДанныеКоманды, пСткВозврат)
	сткДопДанныеКоманды = пСткДанныеКоманды.ДанныеКоманды.required_data;
	
	// 1. Отправка сообщения в канал
	сткРез = Справочники.Аук_КаналыВзаимодействия.ОтправитьСообщениеВКанал(сткДопДанныеКоманды);
	
	Если Не сткРез.Успех Тогда
		пСткВозврат.Успех		= Ложь;
		пСткВозврат.Результат	= ПредопределенноеЗначение("Перечисление.Аук_РезультатыВыполненияКоманд.ОбработанаСОшибкой");
		пСткВозврат.Комментарий	= сткРез.Результат;
	Иначе	
		// 2. Фиксируем в РС История данных аукционов
		ссНаправление = ПредопределенноеЗначение("Перечисление.Аук_НаправленияДанных.Исходящие");
		
		масЗаписи = РегистрыСведений.Аук_ИсторияДанныхАукционов.СформироватьЗаписиДляДобавленияВИсторию_Сообщение(пСткДанныеКоманды,
																													сткДопДанныеКоманды.message,
																													ссНаправление,
																													сткДопДанныеКоманды.stage_number,
																													сткДопДанныеКоманды.period,
																													сткДопДанныеКоманды.data_element);
		
		РегистрыСведений.Аук_ИсторияДанныхАукционов.ДобавитьЗаписи(масЗаписи);		
	КонецЕсли;
КонецПроцедуры

Процедура ПолучениеДанныхОтУчастника_Реализация(пСткДанныеКоманды, пСткВозврат)
	
	// 1. Записать данные  в РС Аук_ИсторияДанныхАукционов
	сткДопДанныеКоманды = пСткДанныеКоманды.ДанныеКоманды.required_data;
	
	// нужно получить тек. дату здесь, чтобы потом можно было включить в отбор, который в подтверждении
	ТекНомерЭтапа = РегистрыСведений.Аук_ИсторияСтатусовАукционов.ТекущееСостояниеАукциона(пСткДанныеКоманды.Аукцион).НомерЭтапа;
	ТекПериод = ОбщегоНазначенияВызовСервера.ТекущаяДатаСервер_();
	ссНаправление = ПредопределенноеЗначение("Перечисление.Аук_НаправленияДанных.Входящие");
	
	Если сткДопДанныеКоманды.data_type = ПредопределенноеЗначение("Перечисление.Аук_ВидыДанных.Ставка") Тогда	
		масЗаписи = РегистрыСведений.Аук_ИсторияДанныхАукционов.СформироватьЗаписиДляДобавленияВИсторию_Ставка(пСткДанныеКоманды, сткДопДанныеКоманды.data, ТекНомерЭтапа, ТекПериод);
		
		РегистрыСведений.Аук_ИсторияДанныхАукционов.ДобавитьЗаписи(масЗаписи);	
	ИначеЕсли сткДопДанныеКоманды.data_type = ПредопределенноеЗначение("Перечисление.Аук_ВидыДанных.Отказ") Тогда		
		масЗаписи = РегистрыСведений.Аук_ИсторияДанныхАукционов.СформироватьЗаписиДляДобавленияВИсторию_Отказ(пСткДанныеКоманды, сткДопДанныеКоманды.data, ТекНомерЭтапа, ТекПериод);
		
		РегистрыСведений.Аук_ИсторияДанныхАукционов.ДобавитьЗаписи(масЗаписи);	
	ИначеЕсли сткДопДанныеКоманды.data_type = ПредопределенноеЗначение("Перечисление.Аук_ВидыДанных.Сообщение") Тогда		
		масЗаписи = РегистрыСведений.Аук_ИсторияДанныхАукционов.СформироватьЗаписиДляДобавленияВИсторию_Сообщение(пСткДанныеКоманды,
																												  сткДопДанныеКоманды.data,
																												  ссНаправление,
																												  ТекНомерЭтапа,
																												  ТекПериод);
		
		РегистрыСведений.Аук_ИсторияДанныхАукционов.ДобавитьЗаписи(масЗаписи);		
	КонецЕсли;
	
	// 2. Оповестить участника о приеме данных. ВАЖНО: те данные которые мы записали в регистр
	Если сткДопДанныеКоманды.confirmation_required Тогда			
		сткПараметры = Новый Структура;
		
		сткПараметры.Вставить("Аукцион",			пСткДанныеКоманды.Аукцион);
		сткПараметры.Вставить("Период",				ТекПериод + 1);
		сткПараметры.Вставить("Автоматическая", 	пСткДанныеКоманды.Автоматическая);
		сткПараметры.Вставить("КлючРодителя",		пСткДанныеКоманды.КлючКоманды);
		сткПараметры.Вставить("НомерЭтапа",			ТекНомерЭтапа);
		
		сткПараметры.Вставить("СообщенияУчастникам",	ПолучениеДанныхОтУчастника_ДанныеРассылки(пСткДанныеКоманды, ТекПериод));
		
		ОтправитьСообщенияУчастникам_СозданиеКоманд_(сткПараметры);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучениеДанныхОтУчастника_ДанныеРассылки(пСткДанныеКоманды, пТекПериод)
		
	масКонтактныеЛица	= Аук_ОбщийКлиентСервер.ЗначениеВМассив(пСткДанныеКоманды.КонтактноеЛицо);
	
	// 2. Канал взаимодействия + настройки
	сооРез = Справочники.Аук_КонтактныеЛицаУчастниковАукционов.ТекущиеКонтактныеДанныеКонтактныхЛиц(масКонтактныеЛица);
	
	// 3. Получаем шаблон из РС Аук_ШаблоныСообщенийУчастникам
	сткОтбор = Новый Структура;
	сткОтбор.Вставить("ВидСообщения",	пСткДанныеКоманды.ДанныеКоманды.required_data.message_type);
	сткОтбор.Вставить("ВидАукциона",	Справочники.Аук_Аукционы.КлючевыеДанныеАукциона(пСткДанныеКоманды.Аукцион).ВидАукциона);
	сткОтбор.Вставить("Участники",		Аук_ОбщийКлиентСервер.ЗначениеВМассив(пСткДанныеКоманды.Участник));
	
	сооШаблоныСообщений = РегистрыСведений.Аук_ШаблоныСообщенийУчастникам.ШаблонСообщенияПоОтбору(сткОтбор);
	
	/////////////////////
	масПараметры = Новый Массив;
	сооПараметрыСообщений = Новый Соответствие;
	Для Каждого СткЭлСоо Из сооШаблоныСообщений Цикл
		масПараметрыШаблонов = Аук_ОбщийВызовСервера.СтрокаНайтиВсеПоРегулярномуВыражениюТолькоЗначения(СткЭлСоо.Значение.Шаблон + " " + СткЭлСоо.Значение.Заголовок,
																					Аук_ОбщийКлиентСервер.Шаблон_ПараметрыШаблонаСообщения(),,, Истина);
																					
		сооПараметрыСообщений.Вставить(СткЭлСоо.Ключ, масПараметрыШаблонов);																			
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(масПараметры, масПараметрыШаблонов, Истина); 
	КонецЦикла;
	
	сткПараметрыШаблонов = Новый Структура;
	сткПараметрыШаблонов.Вставить("Аукцион", пСткДанныеКоманды.Аукцион);
	сткПараметрыШаблонов.Вставить("Период", пТекПериод);
	сткПараметрыШаблонов.Вставить("Участник", пСткДанныеКоманды.Участник);
	сткПараметрыШаблонов.Вставить("КонтактноеЛицо", пСткДанныеКоманды.КонтактноеЛицо);
	
	сооЗначенияПараметровШаблонов = Аук_ОбщийСервер.ЗначенияПараметровШаблонов(масПараметрыШаблонов, сткПараметрыШаблонов);
	////////////////////
	
	масРезультат = Новый Массив;
	Для Сч = 0 По масКонтактныеЛица.ВГраница() Цикл
		
		сткДанныеСообщения = Новый Структура;
		
		сткДанныеСообщения.Вставить("Участник",			пСткДанныеКоманды.Участник);
		сткДанныеСообщения.Вставить("КонтактноеЛицо",	масКонтактныеЛица[Сч]);
		сткДанныеСообщения.Вставить("СтрокаДанных",		Сч);
		
		Если сооШаблоныСообщений <> Неопределено Тогда
			сткНастройкиСообщения = сооШаблоныСообщений.Получить(пСткДанныеКоманды.Участник);
			
			сткДанныеСообщения.Вставить("ТекстСообщения",	сткНастройкиСообщения.Шаблон);
			сткДанныеСообщения.Вставить("ТемаСообщения",	сткНастройкиСообщения.Заголовок);
			
			масПараметрыШаблонов = сооПараметрыСообщений.Получить(пСткДанныеКоманды.Участник);
			
			масРез = Новый Массив;
			Для Каждого ЭлМас Из масПараметрыШаблонов Цикл
				масРез.Добавить(Новый Структура("NameParam, ValueParam", ЭлМас, сооЗначенияПараметровШаблонов.Получить(ЭлМас)));	
			КонецЦикла;	
			сткДанныеСообщения.Вставить("ЗначенияПараметровШаблонов", масРез);
			
		Иначе
			сткДанныеСообщения.Вставить("ТекстСообщения",	Неопределено);
			сткДанныеСообщения.Вставить("ТемаСообщения",	Неопределено);
			сткДанныеСообщения.Вставить("ЗначенияПараметровШаблонов", Неопределено);
		КонецЕсли;
		
		сткДанныеКанала = сооРез.Получить(масКонтактныеЛица[Сч]);
		
		Если сткДанныеКанала <> Неопределено Тогда
			сткДанныеСообщения.Вставить("Канал",			сткДанныеКанала.КаналВзаимодействия);
			сткДанныеСообщения.Вставить("НастройкиКанала",	сткДанныеКанала.НастройкиКаналаВзаимодействия);
		Иначе
			сткДанныеСообщения.Вставить("Канал",			Неопределено);
			сткДанныеСообщения.Вставить("НастройкиКанала",	Неопределено);
		КонецЕсли;	
		
		масРезультат.Добавить(сткДанныеСообщения);
		
	КонецЦикла;	
	
	Возврат масРезультат;
	
КонецФункции

Процедура ПеревестиАукционНаСледующийЭтап_Реализация(пСткДанныеКоманды, пСткВозврат)
	// Возможно порядок 1 и 2 нужно будет поменять
	
	// 2. Создать команды оповещения участников		
	сткПараметры = Новый Структура;
	
	сткПараметры.Вставить("Аукцион",				пСткДанныеКоманды.Аукцион);
	сткПараметры.Вставить("Автоматическая", 		пСткДанныеКоманды.Автоматическая);
	сткПараметры.Вставить("КлючРодителя",			пСткДанныеКоманды.КлючКоманды);
	сткПараметры.Вставить("НомерЭтапа",				РегистрыСведений.Аук_ИсторияСтатусовАукционов.ТекущееСостояниеАукциона(пСткДанныеКоманды.Аукцион).НомерЭтапа);
	
	сткПараметры.Вставить("СообщенияУчастникам",	ПеревестиАукционНаСледующийЭтап_ДанныеРассылки(пСткДанныеКоманды));
	
	ОтправитьСообщенияУчастникам_СозданиеКоманд_(сткПараметры);
	
	// 1. Зафиксировать изменение статуса
	Аук_ОбщийСервер.ПеревестиАукционНаНовыйЭтап_(пСткДанныеКоманды.Аукцион);
	
	// 3. Если команда автоматическая то сделаем служебную рассылку сотрудникам
	Если пСткДанныеКоманды.Автоматическая Тогда 
		сткПараметры.Вставить("НастройкиПисьма", ПеревестиАукционНаСледующийЭтап_НастройкаОповещения(сткПараметры));
		
		СлужебноеОповещение_СозданиеКоманды(сткПараметры);
	КонецЕсли;
КонецПроцедуры

Функция ПеревестиАукционНаСледующийЭтап_ДанныеРассылки(пСткДанныеКоманды)
	
	масУчастники = Справочники.Аук_Аукционы.УчастникиАукциона(пСткДанныеКоманды.Аукцион);
	
	тзКонтактныеЛицаУчастников = Справочники.Аук_Аукционы.КонтактныеЛицаСПривязкойКУчастникам(пСткДанныеКоманды.Аукцион);
	
	масКонтактныеЛица = тзКонтактныеЛицаУчастников.ВыгрузитьКолонку("КонтактноеЛицо");
	
	// 2. Канал взаимодействия + настройки
	сооРез = Справочники.Аук_КонтактныеЛицаУчастниковАукционов.ТекущиеКонтактныеДанныеКонтактныхЛиц(масКонтактныеЛица);
	
	// 3. Получаем шаблон из РС Аук_ШаблоныСообщенийУчастникам
	сткОтбор = Новый Структура;
	сткОтбор.Вставить("ВидСообщения",	ПредопределенноеЗначение("Перечисление.Аук_ВидыСообщенийУчастникам.УведомлениеУчастникаОЗавершенииЭтапаАукциона"));
	сткОтбор.Вставить("ВидАукциона",	Справочники.Аук_Аукционы.КлючевыеДанныеАукциона(пСткДанныеКоманды.Аукцион).ВидАукциона);
	сткОтбор.Вставить("Участники",		масУчастники);
	
	сооШаблоныСообщений = РегистрыСведений.Аук_ШаблоныСообщенийУчастникам.ШаблонСообщенияПоОтбору(сткОтбор);
	
	/////////////////////
	масПараметры = Новый Массив;
	сооПараметрыСообщений = Новый Соответствие;
	Для Каждого СткЭлСоо Из сооШаблоныСообщений Цикл
		масПараметрыШаблонов = Аук_ОбщийВызовСервера.СтрокаНайтиВсеПоРегулярномуВыражениюТолькоЗначения(СткЭлСоо.Значение.Шаблон + " " + СткЭлСоо.Значение.Заголовок,
																					Аук_ОбщийКлиентСервер.Шаблон_ПараметрыШаблонаСообщения(),,, Истина);
																					
		сооПараметрыСообщений.Вставить(СткЭлСоо.Ключ, масПараметрыШаблонов);																			
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(масПараметры, масПараметрыШаблонов, Истина); 
	КонецЦикла;
	
	сткПараметрыШаблонов = Новый Структура;
	сткПараметрыШаблонов.Вставить("Аукцион", пСткДанныеКоманды.Аукцион);
	
	сооЗначенияПараметровШаблонов = Аук_ОбщийСервер.ЗначенияПараметровШаблонов(масПараметрыШаблонов, сткПараметрыШаблонов);
	////////////////////
	
	масРезультат = Новый Массив;
	Для Каждого ЭлУчастник Из масУчастники Цикл
		масСтрокиТзУчастники = тзКонтактныеЛицаУчастников.НайтиСтроки(Новый Структура("Участник", ЭлУчастник));
		
		Для Сч_ = 0 По масСтрокиТзУчастники.ВГраница() Цикл
			
			сткДанныеСообщения = Новый Структура;
			
			сткДанныеСообщения.Вставить("Участник",			ЭлУчастник);
			сткДанныеСообщения.Вставить("КонтактноеЛицо",	масСтрокиТзУчастники[Сч_].КонтактноеЛицо);
			сткДанныеСообщения.Вставить("СтрокаДанных",		Сч_);
						
			Если сооШаблоныСообщений <> Неопределено Тогда
				сткНастройкиСообщения = сооШаблоныСообщений.Получить(ЭлУчастник);
				
				сткДанныеСообщения.Вставить("ТекстСообщения",	сткНастройкиСообщения.Шаблон);
				сткДанныеСообщения.Вставить("ТемаСообщения",	сткНастройкиСообщения.Заголовок);
				
				масПараметрыШаблонов = сооПараметрыСообщений.Получить(ЭлУчастник);
				
				масРез = Новый Массив;
				Для Каждого ЭлМас Из масПараметрыШаблонов Цикл
					масРез.Добавить(Новый Структура("NameParam, ValueParam", ЭлМас, сооЗначенияПараметровШаблонов.Получить(ЭлМас)));	
				КонецЦикла;	
				сткДанныеСообщения.Вставить("ЗначенияПараметровШаблонов", масРез);
				
			Иначе
				сткДанныеСообщения.Вставить("ТекстСообщения",	Неопределено);
				сткДанныеСообщения.Вставить("ТемаСообщения",	Неопределено);
				сткДанныеСообщения.Вставить("ЗначенияПараметровШаблонов", Неопределено);
			КонецЕсли;
			
			сткДанныеКанала = сооРез.Получить(масСтрокиТзУчастники[Сч_].КонтактноеЛицо);
			
			Если сткДанныеКанала <> Неопределено Тогда
				сткДанныеСообщения.Вставить("Канал",			сткДанныеКанала.КаналВзаимодействия);
				сткДанныеСообщения.Вставить("НастройкиКанала",	сткДанныеКанала.НастройкиКаналаВзаимодействия);
			Иначе
				сткДанныеСообщения.Вставить("Канал",			Неопределено);
				сткДанныеСообщения.Вставить("НастройкиКанала",	Неопределено);
			КонецЕсли;	
			
			масРезультат.Добавить(сткДанныеСообщения);
			
		КонецЦикла;	
	КонецЦикла;
	
	Возврат масРезультат;
	
КонецФункции

Процедура ЗафиксироватьПромежуточныеИтогиАукциона_Реализация(пСткДанныеКоманды, пСткВозврат)	
	сткДопДанныеКоманды = пСткДанныеКоманды.ДанныеКоманды.required_data;
	
	сткЛидирующаяСтавка = Новый Структура;	
	
	сткЛидирующаяСтавка.Вставить("ДатаСтавки",			сткДопДанныеКоманды.bid_date);
	сткЛидирующаяСтавка.Вставить("Аукцион",				пСткДанныеКоманды.Аукцион);
	сткЛидирующаяСтавка.Вставить("Участник",			сткДопДанныеКоманды.participant);
	сткЛидирующаяСтавка.Вставить("СтрокаДанных",		сткДопДанныеКоманды.data_element);
	
	сткЛидирующаяСтавка.Вставить("НомерЭтапа",			сткДопДанныеКоманды.stage_number);	
	сткЛидирующаяСтавка.Вставить("РезультатРасчета",		сткДопДанныеКоманды.calculation_result);
	сткЛидирующаяСтавка.Вставить("ПредставлениеРезультатаРасчета",	сткДопДанныеКоманды.calculation_result_view);
	
	сткЛидирующаяСтавка.Вставить("ДатаЗаписи",		ОбщегоНазначенияВызовСервера.ТекущаяДатаСервер_());
	
	// 1. Зафиксировать в РС Аук_ИтогиЗавершенияЭтапов
	РегистрыСведений.Аук_ИтогиЗавершенияЭтапов.ДобавитьЗапись(сткЛидирующаяСтавка);
	
	// 2. Создать команды оповещения всем участникам	
	сткПараметры = Новый Структура;
	
	сткПараметры.Вставить("Аукцион",				пСткДанныеКоманды.Аукцион);
	сткПараметры.Вставить("Автоматическая", 		пСткДанныеКоманды.Автоматическая);
	сткПараметры.Вставить("КлючРодителя",			пСткДанныеКоманды.КлючКоманды);
	сткПараметры.Вставить("НомерЭтапа",				сткДопДанныеКоманды.stage_number);
	
	сткПараметры.Вставить("СообщенияУчастникам",	ЗафиксироватьПромежуточныеИтогиАукциона_ДанныеРассылки(пСткДанныеКоманды));
	
	ОтправитьСообщенияУчастникам_СозданиеКоманд_(сткПараметры);
	
	// 3. Зафиксировать изменение статуса	
	Аук_ОбщийСервер.ПеревестиАукционНаНовыйЭтап_(пСткДанныеКоманды.Аукцион);
	
	// 4. Если команда автоматическая то сделаем служебную рассылку сотрудникам
	Если пСткДанныеКоманды.Автоматическая Тогда 
		сткПараметры.Вставить("НастройкиПисьма", ЗафиксироватьПромежуточныеИтогиАукциона_НастройкаОповещения(сткПараметры));
		
		СлужебноеОповещение_СозданиеКоманды(сткПараметры);
	КонецЕсли	
КонецПроцедуры

Функция ЗафиксироватьПромежуточныеИтогиАукциона_ДанныеРассылки(пСткДанныеКоманды)
		
	тзКонтактныеЛицаУчастников = Справочники.Аук_Аукционы.КонтактныеЛицаСПривязкойКУчастникам(пСткДанныеКоманды.Аукцион);
	
	масКонтактныеЛица = тзКонтактныеЛицаУчастников.ВыгрузитьКолонку("КонтактноеЛицо");
	
	масУчастники = Справочники.Аук_Аукционы.УчастникиАукциона(пСткДанныеКоманды.Аукцион);
	
	// 2. Канал взаимодействия + настройки
	сооРез = Справочники.Аук_КонтактныеЛицаУчастниковАукционов.ТекущиеКонтактныеДанныеКонтактныхЛиц(масКонтактныеЛица);
	
	// 3. Получаем шаблон из РС Аук_ШаблоныСообщенийУчастникам
	сткОтбор = Новый Структура;
	сткОтбор.Вставить("ВидСообщения",	ПредопределенноеЗначение("Перечисление.Аук_ВидыСообщенийУчастникам.УведомлениеУчастникаОПромежуточномПобедителе"));
	сткОтбор.Вставить("ВидАукциона",	Справочники.Аук_Аукционы.КлючевыеДанныеАукциона(пСткДанныеКоманды.Аукцион).ВидАукциона);
	сткОтбор.Вставить("Участники",		масУчастники);
	
	сооШаблоныСообщений = РегистрыСведений.Аук_ШаблоныСообщенийУчастникам.ШаблонСообщенияПоОтбору(сткОтбор);
	
	/////////////////////
	масПараметры = Новый Массив;
	сооПараметрыСообщений = Новый Соответствие;
	Для Каждого СткЭлСоо Из сооШаблоныСообщений Цикл
		масПараметрыШаблонов = Аук_ОбщийВызовСервера.СтрокаНайтиВсеПоРегулярномуВыражениюТолькоЗначения(СткЭлСоо.Значение.Шаблон + " " + СткЭлСоо.Значение.Заголовок,
																					Аук_ОбщийКлиентСервер.Шаблон_ПараметрыШаблонаСообщения(),,, Истина);
																					
		сооПараметрыСообщений.Вставить(СткЭлСоо.Ключ, масПараметрыШаблонов);																			
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(масПараметры, масПараметрыШаблонов, Истина); 
	КонецЦикла;
	
	сткПараметрыШаблонов = Новый Структура;
	сткПараметрыШаблонов.Вставить("Аукцион", пСткДанныеКоманды.Аукцион);
	
	сооЗначенияПараметровШаблонов = Аук_ОбщийСервер.ЗначенияПараметровШаблонов(масПараметрыШаблонов, сткПараметрыШаблонов);
	////////////////////
	
	масРезультат = Новый Массив;
	Для Каждого ЭлУчастник Из масУчастники Цикл
		масСтрокиТзУчастники = тзКонтактныеЛицаУчастников.НайтиСтроки(Новый Структура("Участник", ЭлУчастник));
		
		Для Сч_ = 0 По масСтрокиТзУчастники.ВГраница() Цикл
			
			сткДанныеСообщения = Новый Структура;
			
			сткДанныеСообщения.Вставить("Участник",			ЭлУчастник);
			сткДанныеСообщения.Вставить("КонтактноеЛицо",	масСтрокиТзУчастники[Сч_].КонтактноеЛицо);
			сткДанныеСообщения.Вставить("СтрокаДанных",		Сч_);
			
			Если сооШаблоныСообщений <> Неопределено Тогда
				сткНастройкиСообщения = сооШаблоныСообщений.Получить(ЭлУчастник);
				
				сткДанныеСообщения.Вставить("ТекстСообщения",	сткНастройкиСообщения.Шаблон);
				сткДанныеСообщения.Вставить("ТемаСообщения",	сткНастройкиСообщения.Заголовок);
				
				масПараметрыШаблонов = сооПараметрыСообщений.Получить(ЭлУчастник);
				
				масРез = Новый Массив;
				Для Каждого ЭлМас Из масПараметрыШаблонов Цикл
					масРез.Добавить(Новый Структура("NameParam, ValueParam", ЭлМас, сооЗначенияПараметровШаблонов.Получить(ЭлМас)));	
				КонецЦикла;	
				сткДанныеСообщения.Вставить("ЗначенияПараметровШаблонов", масРез);
				
			Иначе
				сткДанныеСообщения.Вставить("ТекстСообщения",	Неопределено);
				сткДанныеСообщения.Вставить("ТемаСообщения",	Неопределено);
				сткДанныеСообщения.Вставить("ЗначенияПараметровШаблонов", Неопределено);
			КонецЕсли;
			
			сткДанныеКанала = сооРез.Получить(масСтрокиТзУчастники[Сч_].КонтактноеЛицо);
			
			Если сткДанныеКанала <> Неопределено Тогда
				сткДанныеСообщения.Вставить("Канал",			сткДанныеКанала.КаналВзаимодействия);
				сткДанныеСообщения.Вставить("НастройкиКанала",	сткДанныеКанала.НастройкиКаналаВзаимодействия);
			Иначе
				сткДанныеСообщения.Вставить("Канал",			Неопределено);
				сткДанныеСообщения.Вставить("НастройкиКанала",	Неопределено);
			КонецЕсли;	
			
			масРезультат.Добавить(сткДанныеСообщения);
			
		КонецЦикла;	
	КонецЦикла;
	
	Возврат масРезультат;
	
КонецФункции

Процедура ЗавершитьАукцион_Реализация(пСткДанныеКоманды, пСткВозврат)
	
	// Если только сохранение, то делаем записи в РС Аук_ДанныеШапокПодведенияИтогов и РС Аук_ДанныеТаблицПодведенияИтогов
	// Иначе делаем записи в регистры + оповещение победителей + Изменение статуса
	
	// 1. Зафиксировать данные шапки (условия аукциона)
	сткПараметры = РегистрыСведений.Аук_ДанныеШапокПодведенияИтогов.СтруктураЗаписи();
	
	сткПараметры.Аукцион		= пСткДанныеКоманды.Аукцион;
	
	сооОбязательныеДанные = пСткДанныеКоманды.ДанныеКоманды.required_data;
	
	сткПараметры.ОбщаяСумма		= сооОбязательныеДанные.total_amount;
	сткПараметры.ОбщийСрок		= сооОбязательныеДанные.total_time;
	
	РегистрыСведений.Аук_ДанныеШапокПодведенияИтогов.ДобавитьЗапись(сткПараметры);
	
	сткПараметры = РегистрыСведений.Аук_ДанныеШапокПодведенияИтогов.СтруктураЗаписи();
	
	// 2. Зафиксировать итоги аукциона
	сткПараметры = РегистрыСведений.Аук_ДанныеТаблицПодведенияИтогов.СтруктураЗаписи();
	сткПараметры.Аукцион		= пСткДанныеКоманды.Аукцион;
	сткПараметры.ИтогиАукциона	= сооОбязательныеДанные.auction_results;
	
	РегистрыСведений.Аук_ДанныеТаблицПодведенияИтогов.ЗафиксироватьИтогиАукциона(сткПараметры);
	
	Если Не сооОбязательныеДанные.only_saving Тогда
		// 5. Создать команды оповещения участникам победителям
		сткПараметры = Новый Структура;
		
		сткПараметры.Вставить("Аукцион",				пСткДанныеКоманды.Аукцион);
		сткПараметры.Вставить("Автоматическая", 		пСткДанныеКоманды.Автоматическая);
		сткПараметры.Вставить("КлючРодителя",			пСткДанныеКоманды.КлючКоманды);
		сткПараметры.Вставить("НомерЭтапа",				0);
		
		сткПараметры.Вставить("СообщенияУчастникам",	ЗавершитьАукцион_ДанныеРассылки(пСткДанныеКоманды));
		
		ОтправитьСообщенияУчастникам_СозданиеКоманд_(сткПараметры); 
		
		// 4. Зафиксировать изменение статуса
		Аук_ОбщийСервер.ПеревестиАукционВЗавершенные_(пСткДанныеКоманды.Аукцион);
		
		// 6. Если команда автоматическая то сделаем служебную рассылку сотрудникам
		Если пСткДанныеКоманды.Автоматическая Тогда 
			сткПараметры.Вставить("НастройкиПисьма", ЗавершитьАукцион_НастройкаОповещения(сткПараметры));
			
			СлужебноеОповещение_СозданиеКоманды(сткПараметры);
		КонецЕсли
	КонецЕсли;	
	
КонецПроцедуры

Функция ЗавершитьАукцион_ДанныеРассылки(пСткДанныеКоманды)
	
	сооОбязательныеДанные = пСткДанныеКоманды.ДанныеКоманды["required_data"];
	
	// 1. Связка Участник + Контактные лица по аукциону, по конкретным участникам
	тзПобедителиТемп = Новый ТаблицаЗначений;
	тзПобедителиТемп.Колонки.Добавить("Участник", Новый ОписаниеТипов("СправочникСсылка.Аук_УчастникиАукционов"));
	тзПобедителиТемп.Колонки.Добавить("СтрокаДанных", Новый ОписаниеТипов("Число"));
	тзПобедителиТемп.Колонки.Добавить("ЭтоПобедитель", Новый ОписаниеТипов("Булево"));
	
	Для Каждого ЭлМас Из сооОбязательныеДанные["auction_results"] Цикл	
		Если ЭлМас.ЭтоПобедитель Тогда	
			ЗаполнитьЗначенияСвойств(тзПобедителиТемп.Добавить(), ЭлМас); 
		КонецЕсли;		
	КонецЦикла;
	
	тзУчастникиПобедители = тзПобедителиТемп.Скопировать();
	
	тзУчастникиПобедители.Свернуть("Участник");
	
	масПобедители = тзУчастникиПобедители.ВыгрузитьКолонку("Участник");
	
	тзКонтактныеЛицаУчастников = Справочники.Аук_Аукционы.КонтактныеЛицаСПривязкойКУчастникам(пСткДанныеКоманды.Аукцион, масПобедители);
	
	масКонтактныеЛица = тзКонтактныеЛицаУчастников.ВыгрузитьКолонку("КонтактноеЛицо");
	
	// 2. Канал взаимодействия + настройки
	сооРез = Справочники.Аук_КонтактныеЛицаУчастниковАукционов.ТекущиеКонтактныеДанныеКонтактныхЛиц(масКонтактныеЛица);
	
	// 3. Получаем шаблон из РС Аук_ШаблоныСообщенийУчастникам
	сткОтбор = Новый Структура;
	сткОтбор.Вставить("ВидСообщения",	ПредопределенноеЗначение("Перечисление.Аук_ВидыСообщенийУчастникам.УведомлениеПобедителяАукционаОПобеде"));
	сткОтбор.Вставить("ВидАукциона",	Справочники.Аук_Аукционы.КлючевыеДанныеАукциона(пСткДанныеКоманды.Аукцион).ВидАукциона);
	сткОтбор.Вставить("Участники",		масПобедители);
	
	сооШаблоныСообщений = РегистрыСведений.Аук_ШаблоныСообщенийУчастникам.ШаблонСообщенияПоОтбору(сткОтбор);
		
	масРезультат = Новый Массив;
	Для Каждого СтрокаТз Из тзПобедителиТемп Цикл
		масСтрокиТзУчастники = тзКонтактныеЛицаУчастников.НайтиСтроки(Новый Структура("Участник", СтрокаТз.Участник));
		
		Для Сч_ = 0 По масСтрокиТзУчастники.ВГраница() Цикл
			
			сткДанныеСообщения = Новый Структура;
			
			сткДанныеСообщения.Вставить("Участник",			СтрокаТз.Участник);
			сткДанныеСообщения.Вставить("КонтактноеЛицо",	масСтрокиТзУчастники[Сч_].КонтактноеЛицо);
			сткДанныеСообщения.Вставить("СтрокаДанных",		Сч_);
						
			Если сооШаблоныСообщений <> Неопределено Тогда
				сткНастройкиСообщения = сооШаблоныСообщений.Получить(СтрокаТз.Участник);
				
				сткДанныеСообщения.Вставить("ТекстСообщения",	сткНастройкиСообщения.Шаблон);
				сткДанныеСообщения.Вставить("ТемаСообщения",	сткНастройкиСообщения.Заголовок);
								
				/////////////////////
				масПараметры = Новый Массив;
				
				масПараметрыШаблонов = Аук_ОбщийВызовСервера.СтрокаНайтиВсеПоРегулярномуВыражениюТолькоЗначения(сткНастройкиСообщения.Шаблон + " " + сткНастройкиСообщения.Заголовок,
																											Аук_ОбщийКлиентСервер.Шаблон_ПараметрыШаблонаСообщения(),,, Истина);
				
				ОбщегоНазначенияКлиентСервер.ДополнитьМассив(масПараметры, масПараметрыШаблонов, Истина); 
				
				сткПараметрыШаблонов = Новый Структура;
				сткПараметрыШаблонов.Вставить("Аукцион",		пСткДанныеКоманды.Аукцион);
				сткПараметрыШаблонов.Вставить("Участник",		СтрокаТз.Участник);
				сткПараметрыШаблонов.Вставить("СтрокаДанных",	СтрокаТз.СтрокаДанных);
				
				сооЗначенияПараметровШаблонов = Аук_ОбщийСервер.ЗначенияПараметровШаблонов(масПараметрыШаблонов, сткПараметрыШаблонов);
				////////////////////
				
				масРез = Новый Массив;
				Для Каждого ЭлМас Из масПараметрыШаблонов Цикл
					масРез.Добавить(Новый Структура("NameParam, ValueParam", ЭлМас, сооЗначенияПараметровШаблонов.Получить(ЭлМас)));	
				КонецЦикла;	
				сткДанныеСообщения.Вставить("ЗначенияПараметровШаблонов", масРез);
				
			Иначе
				сткДанныеСообщения.Вставить("ТекстСообщения",	Неопределено);
				сткДанныеСообщения.Вставить("ТемаСообщения",	Неопределено);
				сткДанныеСообщения.Вставить("ЗначенияПараметровШаблонов", Неопределено);
			КонецЕсли;
			
			сткДанныеКанала = сооРез.Получить(масСтрокиТзУчастники[Сч_].КонтактноеЛицо);
			
			Если сткДанныеКанала <> Неопределено Тогда
				сткДанныеСообщения.Вставить("Канал",			сткДанныеКанала.КаналВзаимодействия);
				сткДанныеСообщения.Вставить("НастройкиКанала",	сткДанныеКанала.НастройкиКаналаВзаимодействия);
			Иначе
				сткДанныеСообщения.Вставить("Канал",			Неопределено);
				сткДанныеСообщения.Вставить("НастройкиКанала",	Неопределено);
			КонецЕсли;	
			
			масРезультат.Добавить(сткДанныеСообщения);
			
		КонецЦикла;	
	КонецЦикла;
	
	Возврат масРезультат;
	
КонецФункции	

Функция ОтправкаПростогоСообщенияУчастникам_ДанныеРассылки(пСткДанные) Экспорт
	масУчастники = Справочники.Аук_Аукционы.УчастникиАукциона(пСткДанные.Аукцион);
	
	// 1. Преобразовать массив адресатов в тз
	тзТемп = Новый ТаблицаЗначений;
	тзТемп.Колонки.Добавить("Участник", Новый ОписаниеТипов("СправочникСсылка.Аук_УчастникиАукционов"));
	тзТемп.Колонки.Добавить("КонтактноеЛицо", Новый ОписаниеТипов("СправочникСсылка.Аук_КонтактныеЛицаУчастниковАукционов"));
	
	Для Каждого ЭлМас Из пСткДанные.Адресаты Цикл
		ЗаполнитьЗначенияСвойств(тзТемп.Добавить(), ЭлМас); 	
	КонецЦикла;	
		
	// 2. Канал взаимодействия + настройки
	сооРез = Справочники.Аук_КонтактныеЛицаУчастниковАукционов.ТекущиеКонтактныеДанныеКонтактныхЛиц(тзТемп.ВыгрузитьКолонку("КонтактноеЛицо"));
	
	тзУчастники = тзТемп.Скопировать();
	
	тзУчастники.Свернуть("Участник");
	
	масУчастники = тзУчастники.ВыгрузитьКолонку("Участник");
	
	// 3. Получаем шаблон из РС Аук_ШаблоныСообщенийУчастникам
	сткОтбор = Новый Структура;
	сткОтбор.Вставить("ВидСообщения",	ПредопределенноеЗначение("Перечисление.Аук_ВидыСообщенийУчастникам.ПростоеСообщение"));
	сткОтбор.Вставить("ВидАукциона",	Справочники.Аук_Аукционы.КлючевыеДанныеАукциона(пСткДанные.Аукцион).ВидАукциона);
	сткОтбор.Вставить("Участники",		масУчастники);
	
	сооШаблоныСообщений = РегистрыСведений.Аук_ШаблоныСообщенийУчастникам.ШаблонСообщенияПоОтбору(сткОтбор);
	
	масРезультат = Новый Массив;
	Для Каждого ЭлУчастник Из масУчастники Цикл
		масСтрокиТзУчастники = тзТемп.НайтиСтроки(Новый Структура("Участник", ЭлУчастник));
		
		Для Сч = 0 По масСтрокиТзУчастники.ВГраница() Цикл
			
			сткДанныеСообщения = Новый Структура;
			
			сткДанныеСообщения.Вставить("Участник",			ЭлУчастник);
			сткДанныеСообщения.Вставить("КонтактноеЛицо",	масСтрокиТзУчастники[Сч].КонтактноеЛицо);
			сткДанныеСообщения.Вставить("СтрокаДанных",		Сч);
			
			Если сооШаблоныСообщений <> Неопределено Тогда
				сткНастройкиСообщения = сооШаблоныСообщений.Получить(ЭлУчастник);
			
				сткДанныеСообщения.Вставить("ТемаСообщения",	сткНастройкиСообщения.Заголовок);	
			Иначе
				сткДанныеСообщения.Вставить("ТемаСообщения",	Неопределено);
			КонецЕсли;
			
			сткДанныеСообщения.Вставить("ТекстСообщения",	пСткДанные.ТекстСообщения);	
			//
			//сткДанныеСообщения.Вставить("ТемаСообщения",	НСтр("ru = 'Рассылка'"));
			
			сткДанныеСообщения.Вставить("ЗначенияПараметровШаблонов", Неопределено);
			
			сткДанныеКанала = сооРез.Получить(масСтрокиТзУчастники[Сч].КонтактноеЛицо);
			
			Если сткДанныеКанала <> Неопределено Тогда
				сткДанныеСообщения.Вставить("Канал",			сткДанныеКанала.КаналВзаимодействия);
				сткДанныеСообщения.Вставить("НастройкиКанала",	сткДанныеКанала.НастройкиКаналаВзаимодействия);
			Иначе
				сткДанныеСообщения.Вставить("Канал",			Неопределено);
				сткДанныеСообщения.Вставить("НастройкиКанала",	Неопределено);
			КонецЕсли;
			
			масРезультат.Добавить(сткДанныеСообщения);
			
		КонецЦикла;	
	КонецЦикла;
	
	Возврат масРезультат;
	
КонецФункции

Процедура ПоместитьВАрхив_Реализация(пСткДанныеКоманды, пСткВозврат)	
	
	// 1. Зафиксировать изменение статуса
	Аук_ОбщийСервер.ПоместитьАукционВАрхив_(пСткДанныеКоманды.Аукцион);
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиИнформационныхПисем

// Формирует настройки письма сотрудникам при выполнении команды "ПроверитьВозможностьНачалаАукциона"
//
// Параметры:
//  пСткПараметры	 - 	 Структура
//		*Аукцион - СправочникСсылка.Аук_Аукционы - (обязательно) - аукцион, по которому требуется отправка уведомления
// 
// Возвращаемое значение:
//	Структура 
//
Функция ПроверитьВозможностьНачалаАукциона_НастройкаОповещения(пСткПараметры) Экспорт

	сткНастройкиПисьма = Аук_УправлениеАукционамиКлиентСервер.ИнформированииОНеобходимостиСтартоватьАукцион();
	
	сткДанныеАукциона = Справочники.Аук_Аукционы.КлючевыеДанныеАукциона(пСткПараметры.Аукцион);
	
	ТемаПисьма	= СтрШаблон(сткНастройкиПисьма.ТемаПисьма,
								сткДанныеАукциона.Наименование);
	
	ТекстПисьма = СтрШаблон(сткНастройкиПисьма.ШаблонПисьма,
								сткДанныеАукциона.Наименование,
								сткДанныеАукциона.Код,
								сткДанныеАукциона.ДатаНачала,
								ПолучитьВнешнююНавигационнуюСсылку(ПолучитьНавигационнуюСсылкуИнформационнойБазы(), ПолучитьНавигационнуюСсылку(пСткПараметры.Аукцион)));
								
	
	сткДанныеРассылки = Новый Структура;
	сткДанныеРассылки.Вставить("ТемаПисьма",	ТемаПисьма);
	сткДанныеРассылки.Вставить("ТекстПисьма",	ТекстПисьма);
	
	Возврат сткДанныеРассылки;
	
КонецФункции	

// Формирует настройки письма сотрудникам при выполнении команды "ПроверитьВозможностиПеревестиАукционНаСледующийЭтап"
//
// Параметры:
//  пСткПараметры	 - 	 Структура
//		*Аукцион - СправочникСсылка.Аук_Аукционы - (обязательно) - аукцион, по которому требуется отправка уведомления
// 
// Возвращаемое значение:
//	Структура 
//
Функция ПроверитьВозможностиПеревестиАукционНаСледующийЭтап_НастройкиПисьма(пСткПараметры) Экспорт

	сткНастройкиПисьма = Аук_УправлениеАукционамиКлиентСервер.ИнформированииОНеобходимостиПеревестиАукционНаСледующийЭтап();
	
	сткДанныеАукциона = Справочники.Аук_Аукционы.КлючевыеДанныеАукциона(пСткПараметры.Аукцион);
	
	ТемаПисьма	= СтрШаблон(сткНастройкиПисьма.ТемаПисьма,
								сткДанныеАукциона.Наименование);
	
	ТекстПисьма = СтрШаблон(сткНастройкиПисьма.ШаблонПисьма,
								сткДанныеАукциона.Наименование,
								сткДанныеАукциона.Код,
								ПолучитьВнешнююНавигационнуюСсылку(ПолучитьНавигационнуюСсылкуИнформационнойБазы(), ПолучитьНавигационнуюСсылку(пСткПараметры.Аукцион)));
	
	сткДанныеРассылки = Новый Структура;
	сткДанныеРассылки.Вставить("ТемаПисьма",	ТемаПисьма);
	сткДанныеРассылки.Вставить("ТекстПисьма",	ТекстПисьма);
	
	Возврат сткДанныеРассылки;
	
КонецФункции

Функция ПроверитьВозможностьПодведенияПромежуточныхИтоговАукциона_НастройкиПисьма(пСткПараметры) Экспорт

	сткНастройкиПисьма = Аук_УправлениеАукционамиКлиентСервер.ИнформированииОНеобходимостиПодведенияПромежуточныхИтогов();
	
	сткДанныеАукциона = Справочники.Аук_Аукционы.КлючевыеДанныеАукциона(пСткПараметры.Аукцион);
	
	ТемаПисьма	= СтрШаблон(сткНастройкиПисьма.ТемаПисьма,
								сткДанныеАукциона.Наименование);
	
	ТекстПисьма = СтрШаблон(сткНастройкиПисьма.ШаблонПисьма,
								сткДанныеАукциона.Наименование,
								сткДанныеАукциона.Код,
								ПолучитьВнешнююНавигационнуюСсылку(ПолучитьНавигационнуюСсылкуИнформационнойБазы(), ПолучитьНавигационнуюСсылку(пСткПараметры.Аукцион)));
	
	сткДанныеРассылки = Новый Структура;
	сткДанныеРассылки.Вставить("ТемаПисьма",	ТемаПисьма);
	сткДанныеРассылки.Вставить("ТекстПисьма",	ТекстПисьма);
	
	Возврат сткДанныеРассылки;
	
КонецФункции

Функция ПроверитьВозможностьЗавершенияАукциона_НастройкиПисьма(пСткПараметры) Экспорт

	сткНастройкиПисьма = Аук_УправлениеАукционамиКлиентСервер.ИнформированииОНеобходимостиЗавершенияАукциона();
	
	сткДанныеАукциона = Справочники.Аук_Аукционы.КлючевыеДанныеАукциона(пСткПараметры.Аукцион);
	
	ТемаПисьма	= СтрШаблон(сткНастройкиПисьма.ТемаПисьма,
								сткДанныеАукциона.Наименование);
	
	ТекстПисьма = СтрШаблон(сткНастройкиПисьма.ШаблонПисьма,
								сткДанныеАукциона.Наименование,
								сткДанныеАукциона.Код,
								ПолучитьВнешнююНавигационнуюСсылку(ПолучитьНавигационнуюСсылкуИнформационнойБазы(), ПолучитьНавигационнуюСсылку(пСткПараметры.Аукцион)));
	
	сткДанныеРассылки = Новый Структура;
	сткДанныеРассылки.Вставить("ТемаПисьма",	ТемаПисьма);
	сткДанныеРассылки.Вставить("ТекстПисьма",	ТекстПисьма);
	
	Возврат сткДанныеРассылки;
	
КонецФункции

Функция НачалоАукциона_НастройкаОповещения(пСткПараметры) Экспорт

	сткНастройкиПисьма = Аук_УправлениеАукционамиКлиентСервер.ИнформированииОСтартеАукциона();
	
	сткДанныеАукциона = Справочники.Аук_Аукционы.КлючевыеДанныеАукциона(пСткПараметры.Аукцион);
	
	ТемаПисьма	= СтрШаблон(сткНастройкиПисьма.ТемаПисьма,
								сткДанныеАукциона.Наименование);
	
	ТекстПисьма = СтрШаблон(сткНастройкиПисьма.ШаблонПисьма,
								сткДанныеАукциона.Наименование,
								сткДанныеАукциона.Код,
								сткДанныеАукциона.ДатаНачала,
								ПолучитьВнешнююНавигационнуюСсылку(ПолучитьНавигационнуюСсылкуИнформационнойБазы(), ПолучитьНавигационнуюСсылку(пСткПараметры.Аукцион)));
								
	
	сткДанныеРассылки = Новый Структура;
	сткДанныеРассылки.Вставить("ТемаПисьма",	ТемаПисьма);
	сткДанныеРассылки.Вставить("ТекстПисьма",	ТекстПисьма);
	
	Возврат сткДанныеРассылки;
	
КонецФункции

Функция ПеревестиАукционНаСледующийЭтап_НастройкаОповещения(пСткПараметры) Экспорт

	сткНастройкиПисьма = Аук_УправлениеАукционамиКлиентСервер.ИнформированииОПереходеАукционаНаСледующийЭтап();
	
	сткДанныеАукциона = Справочники.Аук_Аукционы.КлючевыеДанныеАукциона(пСткПараметры.Аукцион);
	
	ТемаПисьма	= СтрШаблон(сткНастройкиПисьма.ТемаПисьма,
								сткДанныеАукциона.Наименование);
	
	ТекстПисьма = СтрШаблон(сткНастройкиПисьма.ШаблонПисьма,
								сткДанныеАукциона.Наименование,
								сткДанныеАукциона.Код,
								пСткПараметры.НомерЭтапа,
								ПолучитьВнешнююНавигационнуюСсылку(ПолучитьНавигационнуюСсылкуИнформационнойБазы(), ПолучитьНавигационнуюСсылку(пСткПараметры.Аукцион)));
								
	
	сткДанныеРассылки = Новый Структура;
	сткДанныеРассылки.Вставить("ТемаПисьма",	ТемаПисьма);
	сткДанныеРассылки.Вставить("ТекстПисьма",	ТекстПисьма);
	
	Возврат сткДанныеРассылки;
	
КонецФункции

Функция ЗафиксироватьПромежуточныеИтогиАукциона_НастройкаОповещения(пСткПараметры) Экспорт

	сткНастройкиПисьма = Аук_УправлениеАукционамиКлиентСервер.ИнформированииОФиксацииПромежуточныхИтогов();
	
	сткДанныеАукциона = Справочники.Аук_Аукционы.КлючевыеДанныеАукциона(пСткПараметры.Аукцион);
	
	ТемаПисьма	= СтрШаблон(сткНастройкиПисьма.ТемаПисьма,
								сткДанныеАукциона.Наименование);
	
	ТекстПисьма = СтрШаблон(сткНастройкиПисьма.ШаблонПисьма,
								сткДанныеАукциона.Наименование,
								сткДанныеАукциона.Код,
								ПолучитьВнешнююНавигационнуюСсылку(ПолучитьНавигационнуюСсылкуИнформационнойБазы(), ПолучитьНавигационнуюСсылку(пСткПараметры.Аукцион)));
								
	
	сткДанныеРассылки = Новый Структура;
	сткДанныеРассылки.Вставить("ТемаПисьма",	ТемаПисьма);
	сткДанныеРассылки.Вставить("ТекстПисьма",	ТекстПисьма);
	
	Возврат сткДанныеРассылки;
	
КонецФункции

Функция ЗавершитьАукцион_НастройкаОповещения(пСткПараметры) Экспорт

	сткНастройкиПисьма = Аук_УправлениеАукционамиКлиентСервер.ИнформированииОЗавершенииАукциона();
	
	сткДанныеАукциона = Справочники.Аук_Аукционы.КлючевыеДанныеАукциона(пСткПараметры.Аукцион);
	
	ТемаПисьма	= СтрШаблон(сткНастройкиПисьма.ТемаПисьма,
								сткДанныеАукциона.Наименование);
	
	ТекстПисьма = СтрШаблон(сткНастройкиПисьма.ШаблонПисьма,
								сткДанныеАукциона.Наименование,
								сткДанныеАукциона.Код,
								ПолучитьВнешнююНавигационнуюСсылку(ПолучитьНавигационнуюСсылкуИнформационнойБазы(), ПолучитьНавигационнуюСсылку(пСткПараметры.Аукцион)));
								
	
	сткДанныеРассылки = Новый Структура;
	сткДанныеРассылки.Вставить("ТемаПисьма",	ТемаПисьма);
	сткДанныеРассылки.Вставить("ТекстПисьма",	ТекстПисьма);
	
	Возврат сткДанныеРассылки;
	
КонецФункции

#КонецОбласти

#Область ВыполнениеПроверокКорректностиКоманды

Функция ПроверитьВозможностьВыполненияКомандыПоАукциону(пСткДанныеКоманды)
	
	Если пСткДанныеКоманды.Команда = "CheckPossibilityOfStartingAuction" Тогда
		
		Возврат ПроверитьВозможностьНачалаАукциона_ВыполнениеВозможно(пСткДанныеКоманды.Аукцион);
		
	ИначеЕсли пСткДанныеКоманды.Команда = "StartAuction" Тогда		
		
		Возврат НачатьАукцион_ВыполнениеВозможно(пСткДанныеКоманды.Аукцион);
		
	ИначеЕсли пСткДанныеКоманды.Команда = "CheckPossibilityOfMovingAuctionToNextStage" Тогда		
		
		Возврат ПроверитьВозможностиПеревестиАукционНаСледующийЭтап_ВыполнениеВозможно(пСткДанныеКоманды.Аукцион);
		
	ИначеЕсли пСткДанныеКоманды.Команда = "MoveAuctionToNextStage" Тогда		
		
		Возврат ПеревестиАукционНаСледующийЭтап_ВыполнениеВозможно(пСткДанныеКоманды.Аукцион);
		
	ИначеЕсли пСткДанныеКоманды.Команда = "CheckPossibilityOfSummingInterimResults" Тогда		
		
		Возврат ПроверитьВозможностьПодведенияПромежуточныхИтоговАукциона_ВыполнениеВозможно(пСткДанныеКоманды.Аукцион);
		
	ИначеЕсли пСткДанныеКоманды.Команда = "FixTempResultsOfAuction" Тогда		
		
		Возврат ЗафиксироватьПромежуточныеИтогиАукциона_ВыполнениеВозможно(пСткДанныеКоманды.Аукцион);
		
	ИначеЕсли пСткДанныеКоманды.Команда = "CheckPossibilityOfCompletingAuction" Тогда		
		
		Возврат ПроверитьВозможностьЗавершенияАукциона_ВыполнениеВозможно(пСткДанныеКоманды.Аукцион);
		
	ИначеЕсли пСткДанныеКоманды.Команда = "CompletingAuction" Тогда		
		
		Возврат ЗавершитьАукцион_ВыполнениеВозможно(пСткДанныеКоманды.Аукцион);	
		
	КонецЕсли;
	
	Возврат ЭдоОбщий._Успех();
	
КонецФункции	

Функция ПроверитьСоответсвиеДанныхКомандыСДаннымиБазы(пСткДанныеКоманды)
	
	// 1. Проверка наличия в базе аукциона по УИДу
	ссАукцион = Аук_ОбщийСервер.СсылкаОбъектаПоУИД(Тип("СправочникСсылка.Аук_Аукционы"), пСткДанныеКоманды.auction);
	
	Если Не ЗначениеЗаполнено(ссАукцион) Тогда
		Возврат ЭдоОбщий._Ошибка(НСтр("ru = 'Ошибка получения ссылки на аукцион'"));	
	Иначе
		пСткДанныеКоманды.auction = ссАукцион;	
	КонецЕсли; 
	
	// 2. Проверка дополнительных данных на предмет наличия в базе (если ссылочные)
	Возврат ПроверитьДополнительныеДанныеКоманды(пСткДанныеКоманды);
	
КонецФункции

Функция ВыполнитьПроверкуДанныхКомандыИзСтрокиJSON(пСтрДанныеJSON)
	
	// 1. Пытаемся преобразовать JSON в значение	
	Попытка	
		сткДанные = Аук_ОбщийКлиентСервер.JSONВЗначение(пСтрДанныеJSON,, "period,bid_date");	
	Исключение		
		стрТекстОшибки = СтрШаблон(НСтр("ru = 'Ошибка преобразования JSON.%1Описание ошибки: %2.%1Строка JSON: %3'"),
									Символы.ПС, ОписаниеОшибки(), пСтрДанныеJSON);
		
		Возврат ЭдоОбщий._Ошибка(стрТекстОшибки);	
	КонецПопытки;
	
	// 2. Проверяем наличие и заполненность обязательных полей "command" и "auction"
	сткРез = Аук_УправлениеАукционамиКлиентСервер.ПроверкаОбязательныхСвойствВДанныхКоманды(сткДанные);
	
	Если Не сткРез.Успех Тогда	
		стрТекстОшибки = СтрШаблон(НСтр("ru = 'Ошибка данных команды.%1Описание ошибки: %2.%1Строка JSON: %3'"),
									Символы.ПС, сткРез.Результат, пСтрДанныеJSON);
		
		Возврат ЭдоОбщий._Ошибка(стрТекстОшибки);	
	КонецЕсли;
	
	// 3. Команда понятна.
	Если Не ЕстьТакаяКоманда(сткДанные.command) Тогда
		стрТекстОшибки = СтрШаблон(НСтр("ru = 'Нет такой команды.%1Строка JSON: %2'"), Символы.ПС, пСтрДанныеJSON);
		
		Возврат ЭдоОбщий._Ошибка(стрТекстОшибки);	
	КонецЕсли;	
	
	// 4. Проверяем структуру данных команды, наличие обязательных полей
	сткРез = ПроверитьСтруктуруДополнительныхДанныхКоманды(сткДанные);
	
	Если Не сткРез.Успех Тогда
		
		стрТекстОшибки = СтрШаблон(НСтр("ru = 'Ошибка данных команды.%1Описание ошибки: %2.%1Строка JSON: %3'"),
									Символы.ПС, сткРез.Результат, пСтрДанныеJSON);
		
		Возврат ЭдоОбщий._Ошибка(стрТекстОшибки);	
	КонецЕсли;
	
	Возврат ЭдоОбщий._Успех(сткДанные);
		
КонецФункции	

#КонецОбласти

#Область ПроверкиПолнотыДанных

Функция ЕстьТакаяКоманда(пСтрКоманда)

	масВсеКоманды = Перечисления.Аук_Команды.ВсеКомандыВJSONПредставлении();
	
	Возврат масВсеКоманды.Найти(пСтрКоманда) <> Неопределено;
	
КонецФункции

Функция ПроверитьДополнительныеДанныеКоманды(пСткДанныеКоманды)
	Если пСткДанныеКоманды.command = "CompletingAuction" Тогда
		
		Возврат ПроверитьДополнительныеДанныеКоманды_ЗавершитьАукцион(пСткДанныеКоманды);
		
	ИначеЕсли пСткДанныеКоманды.command = "SendMessageToAuctionParticipant" Тогда
		
		Возврат ПроверитьДополнительныеДанныеКоманды_ОтправитьСообщенияУчастникам(пСткДанныеКоманды);
		
	ИначеЕсли пСткДанныеКоманды.command = "FixTempResultsOfAuction" Тогда
		
		Возврат ПроверитьДополнительныеДанныеКоманды_ЗафиксироватьПромежуточныйИтог(пСткДанныеКоманды);
		
	ИначеЕсли пСткДанныеКоманды.command = "ServiceNotification" Тогда
		
		Возврат ПроверитьДополнительныеДанныеКоманды_СлужебноеОповещение(пСткДанныеКоманды);
		
	ИначеЕсли пСткДанныеКоманды.command = "GetDataFromParticipant" Тогда	
		
		Возврат ПроверитьДополнительныеДанныеКоманды_ПолучитьДанныеОтУчастника(пСткДанныеКоманды);
		
	КонецЕсли;
	
	Возврат ЭдоОбщий._Успех();
КонецФункции

// ВАЖНО: структура ставки преобразуется в соответствие, чтобы ключом мог быть любой тип данных
//
Функция ПроверитьДополнительныеДанныеКоманды_ПолучитьДанныеОтУчастника(пСткДанныеКоманды)	
	сткОбязательныеДанные = пСткДанныеКоманды.required_data;
	
	ссВидДанных = XMLЗначение(Тип("ПеречислениеСсылка.Аук_ВидыДанных"), сткОбязательныеДанные.data_type);
	
	Если ссВидДанных = Неопределено Тогда
		Возврат ЭдоОбщий._Ошибка(СтрШаблон(НСтр("ru = 'Неизвестный тип данных <%1>'"), сткОбязательныеДанные.data_type));	
	Иначе
		сткОбязательныеДанные.data_type = ссВидДанных;	
	КонецЕсли; 
	
	// Для вида данных Сообщение не требуется оповещение участника о приеме
	Если ссВидДанных <> ПредопределенноеЗначение("Перечисление.Аук_ВидыДанных.Сообщение") Тогда
		
		ссВидСообщения = XMLЗначение(Тип("ПеречислениеСсылка.Аук_ВидыСообщенийУчастникам"), сткОбязательныеДанные.message_type);
		
		Если ссВидСообщения = Неопределено Тогда
			Возврат ЭдоОбщий._Ошибка(СтрШаблон(НСтр("ru = 'Неизвестный тип данных <%1>'"), сткОбязательныеДанные.message_type));	
		Иначе
			сткОбязательныеДанные.message_type = ссВидСообщения;	
		КонецЕсли; 
		
	КонецЕсли;	
	
	Если ссВидДанных = ПредопределенноеЗначение("Перечисление.Аук_ВидыДанных.Ставка") Тогда	
		// Преобразуем технические наименования элементов ставки в ссылки
		ссВидАукциона = Справочники.Аук_Аукционы.КлючевыеДанныеАукциона(пСткДанныеКоманды.auction).ВидАукциона;
		
		масНастройкиСтавки = Справочники.Аук_ВидыАукционов.ОписаниеСтруктурыСтавкиПоВидуАукциона(ссВидАукциона);
		
		масДанныеСтавкиТек = сткОбязательныеДанные.data;
		
		масОшибки = Новый Массив;
		масДанныеСтавкиНов = Новый Массив;
		Для Каждого ЭлементСтавки Из масДанныеСтавкиТек Цикл
			сооСтавка = Новый Соответствие;
			
			Для Каждого ЭлНастройка Из масНастройкиСтавки Цикл
				
				Если ЭлементСтавки.Свойство(ЭлНастройка.ТехническоеНаименование) Тогда
					ТипЗначенияЭлементаСтавки = ЭлНастройка.ТипЗначения.Типы()[0];
					
					Если ОбщегоНазначения.ЭтоСсылка(ТипЗначенияЭлементаСтавки) Тогда
						
						ЗначениеЭлементаСтавкиСсылка = Аук_ОбщийСервер.СсылкаОбъектаПоУИД(ТипЗначенияЭлементаСтавки, ЭлементСтавки[ЭлНастройка.ТехническоеНаименование]);
						
						Если Не ЭлНастройка.НеОбязательный И Не ЗначениеЗаполнено(ЗначениеЭлементаСтавкиСсылка) Тогда
							стрТекстОшибки = СтрШаблон(НСтр("ru = 'Для обязательного элемента ставки <%1> не было получено значение из базы по УИДу <%2>'"),
																	ЭлНастройка.ТехническоеНаименование, ЭлементСтавки[ЭлНастройка.ТехническоеНаименование]);
							
							масОшибки.Добавить(стрТекстОшибки);	
						Иначе
							сооСтавка.Вставить(ЭлНастройка.Элемент, ЗначениеЭлементаСтавкиСсылка);	
						КонецЕсли;
						
					Иначе
						сооСтавка.Вставить(ЭлНастройка.Элемент, XMLЗначение(ТипЗначенияЭлементаСтавки, ЭлементСтавки[ЭлНастройка.ТехническоеНаименование]));	
					КонецЕсли;
					
				Иначе		
					масОшибки.Добавить(СтрШаблон(НСтр("ru = 'Отсутсвует элемент ставки ""%1""'"), ЭлНастройка.ТехническоеНаименование));	
				КонецЕсли;	
				
			КонецЦикла;
			
			масДанныеСтавкиНов.Добавить(сооСтавка);
		КонецЦикла;
		
		сткОбязательныеДанные.data = масДанныеСтавкиНов;
		
		Если масОшибки.Количество() <> 0 Тогда
			Возврат ЭдоОбщий._Ошибка(СтрСоединить(масОшибки, Символы.ПС));	
		КонецЕсли;	
	КонецЕсли;
			
	Возврат ЭдоОбщий._Успех();
КонецФункции

Функция ПроверитьДополнительныеДанныеКоманды_ЗафиксироватьПромежуточныйИтог(пСткДанныеКоманды)	
	сткОбязательныеДанные = пСткДанныеКоманды.required_data;
	
	// Преобразуем ГУИДы участника и контактного лица в ссылки	
	ссУчастник = Аук_ОбщийСервер.СсылкаОбъектаПоУИД(Тип("СправочникСсылка.Аук_УчастникиАукционов"), сткОбязательныеДанные.participant);
	
	Если Не ЗначениеЗаполнено(ссУчастник) Тогда
		Возврат ЭдоОбщий._Ошибка(НСтр("ru = 'Ошибка получения ссылки на участника'"));	
	Иначе
		сткОбязательныеДанные.participant = ссУчастник;	
	КонецЕсли;
	
	//ссКонтактноеЛицо = Аук_ОбщийСервер.СсылкаОбъектаПоУИД(Тип("СправочникСсылка.Аук_КонтактныеЛицаУчастниковАукционов"), сткОбязательныеДанные.contact_person);
	//
	//Если Не ЗначениеЗаполнено(ссКонтактноеЛицо) Тогда
	//	Возврат ЭдоОбщий._Ошибка(НСтр("ru = 'Ошибка получения ссылки на контактное лицо участника'"));	
	//Иначе
	//	сткОбязательныеДанные.contact_person = ссКонтактноеЛицо;	
	//КонецЕсли;
	
	//// Преобразуем технические наименования элементов ставки в ссылки
	//ссВидАукциона = Справочники.Аук_Аукционы.КлючевыеДанныеАукциона(пСткДанныеКоманды.auction).ВидАукциона;
	//
	//масНастройкиСтавки = Справочники.Аук_ВидыАукционов.ОписаниеСтруктурыСтавкиПоВидуАукциона(ссВидАукциона);
	//
	//сооСтавка = Новый Соответствие;
	//Для Каждого ЭлНастройка Из масНастройкиСтавки Цикл	
	//		
	//	Если сткОбязательныеДанные.bid_data.Свойство(ЭлНастройка.ТехническоеНаименование) Тогда
	//		
	//		ЗначениеЭлементаСтавки = сткОбязательныеДанные.bid_data[ЭлНастройка.ТехническоеНаименование];
	//		
	//		ТипЗначенияЭлементаСтавки = ЭлНастройка.ТипЗначения.Типы()[0];
	//		
	//		Если ОбщегоНазначения.ЭтоСсылка(ТипЗначенияЭлементаСтавки) Тогда
	//			
	//			ЗначениеЭлементаСтавкиСсылка = Аук_ОбщийСервер.СсылкаОбъектаПоУИД(ТипЗначенияЭлементаСтавки, ЗначениеЭлементаСтавки);
	//			
	//			Если Не ЭлНастройка.НеОбязательный И Не ЗначениеЗаполнено(ЗначениеЭлементаСтавкиСсылка) Тогда
	//				стрТекстОшибки = СтрШаблон(НСтр("ru = 'Для обязательного элемента ставки <%1> не было получено значение из базы по УИДу <%2>'"),
	//														ЭлНастройка.ТехническоеНаименование, ЗначениеЭлементаСтавки);
	//						
	//				Возврат ЭдоОбщий._Ошибка(стрТекстОшибки);	
	//			Иначе
	//				сооСтавка.Вставить(ЭлНастройка.Элемент, ЗначениеЭлементаСтавкиСсылка);	
	//			КонецЕсли;
	//			
	//		Иначе	
	//			сооСтавка.Вставить(ЭлНастройка.Элемент, XMLЗначение(ЭлНастройка.ТипЗначения.Типы()[0], ЗначениеЭлементаСтавки));	
	//		КонецЕсли;	
	//		
	//	Иначе	
	//		Возврат ЭдоОбщий._Ошибка(СтрШаблон(НСтр("ru = 'Отсутсвует элемент ставки ""%1""'"), ЭлНастройка.ТехническоеНаименование));		
	//	КонецЕсли;	
	//	
	//КонецЦикла;
	//
	//сткОбязательныеДанные.bid_data = сооСтавка;
	
	Возврат ЭдоОбщий._Успех();
КонецФункции

Функция ПроверитьДополнительныеДанныеКоманды_ОтправитьСообщенияУчастникам(пСткДанныеКоманды)	
	сткОбязательныеДанные = пСткДанныеКоманды.required_data;
	
	ссКанал = Аук_ОбщийСервер.СсылкаОбъектаПоУИД(Тип("СправочникСсылка.Аук_КаналыВзаимодействия"), сткОбязательныеДанные.channel);
	
	Если Не ЗначениеЗаполнено(ссКанал) Тогда
		Возврат ЭдоОбщий._Ошибка(НСтр("ru = 'Ошибка получения ссылки на канал взаимодействия'"));	
	Иначе
		сткОбязательныеДанные.channel = ссКанал;	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(сткОбязательныеДанные.message) Тогда
		Возврат ЭдоОбщий._Ошибка(НСтр("ru = 'В данных команды отсутствует текст сообщения'"));	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(сткОбязательныеДанные.channel_settings) Тогда
		Возврат ЭдоОбщий._Ошибка(НСтр("ru = 'В данных команды отсутствуют настройки канала взаимодействия'"));	
	КонецЕсли;
	
	Возврат ЭдоОбщий._Успех();
КонецФункции

Функция ПроверитьДополнительныеДанныеКоманды_ЗавершитьАукцион(пСткДанныеКоманды)	
	сооОбязательныеДанные = пСткДанныеКоманды.required_data;
	
	масУчастники = Справочники.Аук_Аукционы.УчастникиАукциона(пСткДанныеКоманды.auction);
	
	Для Каждого ЭлМас Из сооОбязательныеДанные.auction_results Цикл
		ссУчастник = XMLЗначение(Тип("СправочникСсылка.Аук_УчастникиАукционов"), ЭлМас.Участник); 
		
		Если масУчастники.Найти(ссУчастник) <> Неопределено Тогда
			ЭлМас.Участник = ссУчастник;
		Иначе
			Возврат ЭдоОбщий._Ошибка(НСтр("ru = 'Участник не найден'"));	
		КонецЕсли;	
	КонецЦикла;
	
	Возврат ЭдоОбщий._Успех();
КонецФункции	

Функция ПроверитьДополнительныеДанныеКоманды_СлужебноеОповещение(пСткДанныеКоманды)	
	сооОбязательныеДанные = пСткДанныеКоманды.required_data;
	
	Если Не ЗначениеЗаполнено(сооОбязательныеДанные.message) Тогда
		Возврат ЭдоОбщий._Ошибка(НСтр("ru = 'Тема письма для служебного оповещения отсутвует'"));	
	КонецЕсли;
	
	масАдреса = Новый Массив;
	Для Каждого ЭлМасПочта Из сооОбязательныеДанные.recipients Цикл
		Если Не ЗначениеЗаполнено(ЭлМасПочта) Тогда
			Продолжить;
		КонецЕсли;
		
		масАдреса.Добавить(ЭлМасПочта);	
	КонецЦикла;
	
	Если масАдреса.Количество() = 0 Тогда
		Возврат ЭдоОбщий._Ошибка(НСтр("ru = 'Отсутвуют адреса пользователей для рассылки уведомлений'"));	
	КонецЕсли;
	
	сооОбязательныеДанные.recipients = масАдреса;
	
	Возврат ЭдоОбщий._Успех();
КонецФункции

Функция ПроверитьСтруктуруДополнительныхДанныхКоманды(пСткДанныеКоманды)
	
	стрКоманда = пСткДанныеКоманды.command; 
	
	Если стрКоманда = "ServiceNotification" Тогда	
		
		Возврат ВалидацияДополнительныхДанных(пСткДанныеКоманды,
					Аук_УправлениеАукционамиКлиентСервер.СлужебноеОповещение_ОписаниеСтруктурыОбязательныхДанных());
		
	ИначеЕсли стрКоманда = "SendMessageToAuctionParticipant" Тогда	
		
		Возврат ВалидацияДополнительныхДанных(пСткДанныеКоманды,
					Аук_УправлениеАукционамиКлиентСервер.ОтправитьСообщениеУчастнику_ОписаниеСтруктурыОбязательныхДанных());
		
	ИначеЕсли стрКоманда = "GetDataFromParticipant" Тогда	
		
		Возврат ВалидацияДополнительныхДанных(пСткДанныеКоманды,
					Аук_УправлениеАукционамиКлиентСервер.ПолучениеДанныхОтУчастника_ОписаниеСтруктурыОбязательныхДанных());
		
	ИначеЕсли стрКоманда = "FixTempResultsOfAuction" Тогда	
		
		Возврат ВалидацияДополнительныхДанных(пСткДанныеКоманды,
					Аук_УправлениеАукционамиКлиентСервер.ЗафиксироватьПромежуточныеИтогиАукциона_ОписаниеСтруктурыОбязательныхДанных());
		
	ИначеЕсли стрКоманда = "CompletingAuction" Тогда	
		
		Возврат ВалидацияДополнительныхДанных(пСткДанныеКоманды,
					Аук_УправлениеАукционамиКлиентСервер.ЗавершитьАукцион_ОписаниеСтруктурыОбязательныхДанных());
		
	КонецЕсли;
	
	Возврат ЭдоОбщий._Успех();
	
КонецФункции

Функция ВалидацияДополнительныхДанных(пСткДанныеКоманды, пПоляДопДанных)

	Если Не пСткДанныеКоманды.Свойство("required_data") Тогда
		
		Возврат ЭдоОбщий._Ошибка(НСтр("ru = 'Отсутствуют обязательные данные ""required_data""'"));
		
	КонецЕсли;
	
	Возврат Аук_УправлениеАукционамиКлиентСервер.ПроверкаДополнительныхСвойствВДанныхКомандыПоСписку(пСткДанныеКоманды.required_data, пПоляДопДанных);
	
КонецФункции	

#КонецОбласти

#Область ПроверкиВозможностейВыполненияКоманд

Функция ПроверитьВозможностьНачалаАукциона_ВыполнениеВозможно(пАукцион)
		
	// 2. Проверка состояния	
	сткТекСостояниеАукциона = РегистрыСведений.Аук_ИсторияСтатусовАукционов.ТекущееСостояниеАукциона(пАукцион);
	
	Если сткТекСостояниеАукциона.Статус <> ПредопределенноеЗначение("Перечисление.Аук_СтатусыАукционов.Новый") Тогда
		
		стрТекстОшибки = СтрШаблон(НСтр("ru = 'Текущий статус аукциона <%1> не позволяет выполнить старт аукциона'"), сткТекСостояниеАукциона.Статус);
		
		Возврат ЭдоОбщий._Ошибка(стрТекстОшибки);
		
	КонецЕсли;
		
	Возврат ЭдоОбщий._Успех();
	
КонецФункции

Функция НачатьАукцион_ВыполнениеВозможно(пАукцион)

	сткТекСостояниеАукциона = РегистрыСведений.Аук_ИсторияСтатусовАукционов.ТекущееСостояниеАукциона(пАукцион);
	
	Если сткТекСостояниеАукциона.Статус <> ПредопределенноеЗначение("Перечисление.Аук_СтатусыАукционов.Новый") Тогда
		
		стрТекстОшибки = СтрШаблон(НСтр("ru = 'Текущий статус аукциона <%1> не позволяет выполнить старт аукциона'"), сткТекСостояниеАукциона.Статус);
		
		Возврат ЭдоОбщий._Ошибка(стрТекстОшибки);
		
	КонецЕсли;	
	
	Возврат ЭдоОбщий._Успех();
	
КонецФункции

Функция ПроверитьВозможностиПеревестиАукционНаСледующийЭтап_ВыполнениеВозможно(пАукцион)

	сткТекСостояниеАукциона = РегистрыСведений.Аук_ИсторияСтатусовАукционов.ТекущееСостояниеАукциона(пАукцион);
	
	Если сткТекСостояниеАукциона.Статус <> ПредопределенноеЗначение("Перечисление.Аук_СтатусыАукционов.НовыйЭтап")
		 И сткТекСостояниеАукциона.Статус <> ПредопределенноеЗначение("Перечисление.Аук_СтатусыАукционов.ПодведениеПромежуточныхИтогов")
	Тогда
		
		стрТекстОшибки = СтрШаблон(НСтр("ru = 'Текущий статус аукциона <%1> не позволяет выполнить переход на следующий этап'"), сткТекСостояниеАукциона.Статус);
		
		Возврат ЭдоОбщий._Ошибка(стрТекстОшибки);
		
	КонецЕсли;	
	
	Возврат ЭдоОбщий._Успех();
	
КонецФункции

Функция ПеревестиАукционНаСледующийЭтап_ВыполнениеВозможно(пАукцион)

	сткТекСостояниеАукциона = РегистрыСведений.Аук_ИсторияСтатусовАукционов.ТекущееСостояниеАукциона(пАукцион);
	
	Если сткТекСостояниеАукциона.Статус <> ПредопределенноеЗначение("Перечисление.Аук_СтатусыАукционов.НовыйЭтап")
		 И сткТекСостояниеАукциона.Статус <> ПредопределенноеЗначение("Перечисление.Аук_СтатусыАукционов.ПодведениеПромежуточныхИтогов")
	Тогда
		
		стрТекстОшибки = СтрШаблон(НСтр("ru = 'Текущий статус аукциона <%1> не позволяет выполнить переход на следующий этап'"), сткТекСостояниеАукциона.Статус);
		
		Возврат ЭдоОбщий._Ошибка(стрТекстОшибки);
		
	КонецЕсли;	
	
	Возврат ЭдоОбщий._Успех();
	
КонецФункции

Функция ПроверитьВозможностьПодведенияПромежуточныхИтоговАукциона_ВыполнениеВозможно(пАукцион)

	сткТекСостояниеАукциона = РегистрыСведений.Аук_ИсторияСтатусовАукционов.ТекущееСостояниеАукциона(пАукцион);
	
	Если сткТекСостояниеАукциона.Статус <> ПредопределенноеЗначение("Перечисление.Аук_СтатусыАукционов.ПодведениеПромежуточныхИтогов") Тогда
		
		стрТекстОшибки = СтрШаблон(НСтр("ru = 'Текущий статус аукциона <%1> не позволяет выполнить подведение промежуточных итогов'"), сткТекСостояниеАукциона.Статус);
		
		Возврат ЭдоОбщий._Ошибка(стрТекстОшибки);
		
	КонецЕсли;	
	
	Возврат ЭдоОбщий._Успех();
	
КонецФункции

Функция ЗафиксироватьПромежуточныеИтогиАукциона_ВыполнениеВозможно(пАукцион)

	сткТекСостояниеАукциона = РегистрыСведений.Аук_ИсторияСтатусовАукционов.ТекущееСостояниеАукциона(пАукцион);
	
	Если сткТекСостояниеАукциона.Статус <> ПредопределенноеЗначение("Перечисление.Аук_СтатусыАукционов.ПодведениеПромежуточныхИтогов") Тогда
		
		стрТекстОшибки = СтрШаблон(НСтр("ru = 'Текущий статус аукциона <%1> не позволяет выполнить подведение промежуточных итогов'"), сткТекСостояниеАукциона.Статус);
		
		Возврат ЭдоОбщий._Ошибка(стрТекстОшибки);
		
	КонецЕсли;	
	
	Возврат ЭдоОбщий._Успех();
	
КонецФункции

Функция ПроверитьВозможностьЗавершенияАукциона_ВыполнениеВозможно(пАукцион)

	сткТекСостояниеАукциона = РегистрыСведений.Аук_ИсторияСтатусовАукционов.ТекущееСостояниеАукциона(пАукцион);
	
	Если сткТекСостояниеАукциона.Статус <> ПредопределенноеЗначение("Перечисление.Аук_СтатусыАукционов.ПодведениеИтогов") Тогда
		
		стрТекстОшибки = СтрШаблон(НСтр("ru = 'Текущий статус аукциона <%1> не позволяет выполнить подведение окончательных итогов'"), сткТекСостояниеАукциона.Статус);
		
		Возврат ЭдоОбщий._Ошибка(стрТекстОшибки);
		
	КонецЕсли;	
	
	Возврат ЭдоОбщий._Успех();
	
КонецФункции 

Функция ЗавершитьАукцион_ВыполнениеВозможно(пАукцион)

	сткТекСостояниеАукциона = РегистрыСведений.Аук_ИсторияСтатусовАукционов.ТекущееСостояниеАукциона(пАукцион);
	
	Если сткТекСостояниеАукциона.Статус <> ПредопределенноеЗначение("Перечисление.Аук_СтатусыАукционов.ПодведениеИтогов") Тогда
		
		стрТекстОшибки = СтрШаблон(НСтр("ru = 'Текущий статус аукциона <%1> не позволяет выполнить подведение окончательных итогов'"), сткТекСостояниеАукциона.Статус);
		
		Возврат ЭдоОбщий._Ошибка(стрТекстОшибки);
		
	КонецЕсли;	
	
	Возврат ЭдоОбщий._Успех();
	
КонецФункции

#КонецОбласти

