
//////////////////////////////////////////////////////////////
// Условное оформление задано программно,
// даже то что можно было бы задать через настройки формы
//

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НачальнаяИнициализация();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиКоманд

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НачальнаяИнициализация()
	
	ЭтотОбъект.Аукцион		= Параметры.Аукцион;
	ЭтотОбъект.ВидАукциона	= Параметры.ВидАукциона;
	
	//Аук_ОбщийСервер.ДобавитьКолонкиДанныхСтавкиПоВидуАукциона(ЭтотОбъект, Параметры.ВидАукциона, "тзИсторияСтавок",,, Ложь); 
	
	Аук_ОбщийСервер.ДобавитьКолонкиДанныхСтавкиПоВидуАукциона(ЭтотОбъект, Параметры.ВидАукциона, "дзИсторияСтавок", Элементы.дзИсторияСтавокГруппа3,, Ложь);
	
	ЗаполнитьИсториюСтавок();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИсториюСтавок()
		
	//тзВсеСтавки = РегистрыСведений.Аук_ИсторияДанныхАукционов.ПолнаяИсторияСтавокУчастниковАукционаВСтроке(Параметры.Аукцион, Параметры.ВидАукциона);
	//
	//тзТемп = РеквизитФормыВЗначение("тзИсторияСтавок");
	//
	//Для Каждого СтрокаТз Из тзВсеСтавки Цикл
	//	
	//	НовСтрока = тзТемп.Добавить();
	//	
	//	ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаТз);
	//	
	//КонецЦикла;
	//
	//ЗначениеВРеквизитФормы(тзТемп, "тзИсторияСтавок");
	
	///////////////////
	масЭтапыАукциона = Справочники.Аук_Аукционы.ЭтапыАукциона(Параметры.Аукцион);
	
	тзВсеСтавки1 = РегистрыСведений.Аук_ИсторияДанныхАукционов.ПолнаяИсторияСтавокУчастниковАукционаПоЭтапамВСтроке(Параметры.Аукцион, Параметры.ВидАукциона);
	
	дзТемп = РеквизитФормыВЗначение("дзИсторияСтавок");
	
	Для Каждого сткЭлЭтап Из масЭтапыАукциона Цикл
		
		масСтрокиТз = тзВсеСтавки1.НайтиСтроки(Новый Структура("Этап", сткЭлЭтап.Этап));
		
		Если масСтрокиТз.Количество() <> 0 Тогда
			
			НовСтрокаГр1 = дзТемп.Строки.Добавить();
			
			НовСтрокаГр1.Этап = сткЭлЭтап.Этап;
			
			Для Каждого СтрокаТз Из масСтрокиТз Цикл
				
				ЗаполнитьЗначенияСвойств(НовСтрокаГр1.Строки.Добавить(), СтрокаТз);
				
			КонецЦикла;	
			
		КонецЕсли;	
		
	КонецЦикла;	
		
	ЗначениеВРеквизитФормы(дзТемп, "дзИсторияСтавок");
	
	/////////////////// УО	
	масПоля = Аук_ОбщийСервер.СписокПодчиненныхПолейВводаЭлементаФормы(Элементы.дзИсторияСтавокГруппа1);
	
	УсловноеОформление.Элементы.Очистить(); 
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ОбщегоНазначения.УстановитьЗначенияПараметровУсловногоОформления(ЭлементОформления, Новый Структура("Видимость", Истина));	
	ОбщегоНазначения.ДобавитьЭлементОтбораУсловногоОформления(ЭлементОформления, "дзИсторияСтавок.Период", "Заполнено");
	ОбщегоНазначения.ДобавитьПолеУсловногоОформления(ЭлементОформления, СтрСоединить(масПоля, ", "));
		
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ОбщегоНазначения.УстановитьЗначенияПараметровУсловногоОформления(ЭлементОформления, Новый Структура("Видимость", Ложь));	
	ОбщегоНазначения.ДобавитьЭлементОтбораУсловногоОформления(ЭлементОформления, "дзИсторияСтавок.Период", "НеЗаполнено");
	ОбщегоНазначения.ДобавитьПолеУсловногоОформления(ЭлементОформления, СтрСоединить(масПоля, ", "));
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ОбщегоНазначения.УстановитьЗначенияПараметровУсловногоОформления(ЭлементОформления, Новый Структура("Видимость", Ложь));	
	ОбщегоНазначения.ДобавитьЭлементОтбораУсловногоОформления(ЭлементОформления, "дзИсторияСтавок.Период", "Заполнено");			
	ОбщегоНазначения.ДобавитьПолеУсловногоОформления(ЭлементОформления, "дзИсторияСтавокЭтап");
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ОбщегоНазначения.УстановитьЗначенияПараметровУсловногоОформления(ЭлементОформления, Новый Структура("Видимость", Истина));	
	ОбщегоНазначения.ДобавитьЭлементОтбораУсловногоОформления(ЭлементОформления, "дзИсторияСтавок.Период", "НеЗаполнено");			
	ОбщегоНазначения.ДобавитьПолеУсловногоОформления(ЭлементОформления, "дзИсторияСтавокЭтап");
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ОбщегоНазначения.УстановитьЗначенияПараметровУсловногоОформления(ЭлементОформления, Новый Структура("ЦветФона", WebЦвета.ХакиТемный));	
	ОбщегоНазначения.ДобавитьЭлементОтбораУсловногоОформления(ЭлементОформления, "дзИсторияСтавок.Период", "НеЗаполнено");			
	ОбщегоНазначения.ДобавитьПолеУсловногоОформления(ЭлементОформления, "дзИсторияСтавокЭтап");
	
	
КонецПроцедуры

#КонецОбласти

