
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Команда1(Команда)
	масСписок = Новый Массив;
	масСписок.Добавить(1);
	масСписок.Добавить(2);
	масСписок.Добавить(3);
	масСписок.Добавить(4);
	масСписок.Добавить(5);
	масСписок.Добавить(6);
	масСписок.Добавить(7);
	
	Сообщ = Новый СообщениеПользователю();
	Сообщ.Текст = СтрШаблон(Нстр("ru = 'Факториал числа %1 равен %2'"), масСписок[3], Факториал(масСписок[3]));
	Сообщ.Сообщить();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция Факториал(Число_)
	Если Число_ = 0 Тогда
		Возврат 1;
	Иначе
		Возврат Число_ * Факториал(Число_ - 1);
	КонецЕсли;
	
	// asdasd
	// вфыв
	// фыврфиыв
КонецФункции	

#КонецОбласти

