
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Аук_ОбщийКлиент.ЗаполнитьПодсказкуДляПоляТехническогоНаименования(ЭтотОбъект); 
	
	Аук_ОбщийКлиент.ЗаполнитьПодсказкуДляПоляНаименования(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.ТехническоеНаименование	= СокрЛП(Объект.ТехническоеНаименование); 
	Объект.Наименование				= СокрЛП(Объект.Наименование);
	
	ПараметрыЗаписи.Вставить("ТехническоеНаименованиеБылоИзменено",	ЭтотОбъект.ТехническоеНаименованиеБылоИзменено);
	ПараметрыЗаписи.Вставить("НаименованиеБылоИзменено",			ЭтотОбъект.НаименованиеБылоИзменено);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Аук_ОбщийСервер.ОбработкаПередЗаписьюФормЭлементовПВХ(ТекущийОбъект, ПараметрыЗаписи, Отказ);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТехническоеНаименованиеПриИзменении(Элемент)
	
	ЭтотОбъект.ТехническоеНаименованиеБылоИзменено = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	ЭтотОбъект.НаименованиеБылоИзменено = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	

#КонецОбласти





