
#Область ПрограммныйИнтерфейс

Функция ДобавитьЗапись(пСтруктураЗаписи) Экспорт	
	сткРез = Аук_ОбщийСервер.ДобавитьЗаписьВРегистрСведений(пСтруктураЗаписи, "Аук_ИтогиЗавершенияЭтапов");
	
	Если Не сткРез.Успех Тогда
		ВызватьИсключение сткРез.Ошибка;	
	КонецЕсли;
КонецФункции

Функция УдалитьЗапись(пСтруктураЗаписи) Экспорт
	
	Возврат Аук_ОбщийСервер.УдалитьНаборЗаписейВРегистреСведений(пСтруктураЗаписи, "Аук_ИтогиЗавершенияЭтапов");
	
КонецФункции	

Функция ИтоговоеЗначениеЛидирующейСтавки(пСткОтбор) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Аук_ИтогиЗавершенияЭтапов.ПредставлениеРезультатаРасчета КАК ПредставлениеРезультатаРасчета
	|ИЗ
	|	РегистрСведений.Аук_ИтогиЗавершенияЭтапов КАК Аук_ИтогиЗавершенияЭтапов
	|ГДЕ
	|	Аук_ИтогиЗавершенияЭтапов.Аукцион = &Аукцион
	|	И Аук_ИтогиЗавершенияЭтапов.НомерЭтапа = &НомерЭтапа";
	
	Запрос.УстановитьПараметр("Аукцион",	пСткОтбор.Аукцион);
	Запрос.УстановитьПараметр("НомерЭтапа", пСткОтбор.НомерЭтапа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";	
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		
		Выборка.Следующий();
		
		Возврат Выборка.ПредставлениеРезультатаРасчета;	
	КонецЕсли;	
КонецФункции

#КонецОбласти