
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//															КОМАНДЫ
//	-------------------------------------------------------------------------------------------------------------------------------
//	| Перечисление											| Команда для JSON								| Есть доп. параметры  |
//  -------------------------------------------------------------------------------------------------------------------------------
//	| ПроверитьВозможностьНачалаАукциона					| CheckPossibilityOfStartingAuction             |          -           |
//	------------------------------------------------------------------------------------------------------------------------------- 
//	| ПроверитьВозможностьПеревестиАукционНаСледующийЭтап	| CheckPossibilityOfMovingAuctionToNextStage    |          -           |
//	-------------------------------------------------------------------------------------------------------------------------------
//	| ПроверитьВозможностьПодведенияПромежуточныхИтогов		| CheckPossibilityOfSummingInterimResults       |          -           |
//	-------------------------------------------------------------------------------------------------------------------------------
//	| ПроверитьВозможностьЗавершенияАукциона				| CheckPossibilityOfCompletingAuction           |          -           |
//	-------------------------------------------------------------------------------------------------------------------------------
//	| ВыполнитьСлужебноеОповещение							| ServiceNotification                           |          +           |
//	-------------------------------------------------------------------------------------------------------------------------------
//	| НачатьАукцион											| StartAuction                                  |          -           |
//	-------------------------------------------------------------------------------------------------------------------------------
//	| ОтправитьСообщениеУчастнику							| SendMessageToAuctionParticipant               |          +           |
//	-------------------------------------------------------------------------------------------------------------------------------
//	| ПолучениеДанныхОтУчастника							| GetDataFromParticipant                        |          +           |
//	-------------------------------------------------------------------------------------------------------------------------------
//	| ЗафиксироватьПромежуточныеИтогиАукциона				| ServiceNotification                           |          +           |
//	-------------------------------------------------------------------------------------------------------------------------------
//	| ПеревестиАукционНаСледующийЭтап						| MoveAuctionToNextStage                        |          -           |
//	-------------------------------------------------------------------------------------------------------------------------------
//	| ЗавершитьАукцион										| CompletingAuction                             |          +           |
//	-------------------------------------------------------------------------------------------------------------------------------
//	| ПоместитьВАрхив										| PutInArchive                                  |          -           |
//	-------------------------------------------------------------------------------------------------------------------------------

Функция ИмяКомандыДляЗаписиВJSONПоСсылке(пСсВидКоманды) Экспорт
		
	Возврат Метаданные.Перечисления.Аук_Команды.ЗначенияПеречисления.Получить(Индекс(пСсВидКоманды)).Комментарий; 
	
КонецФункции

Функция ВсеКомандыВJSONПредставлении() Экспорт
	
	масКоманды = Новый Массив;
	
	Для Каждого ЭлЗначение Из Метаданные.Перечисления.Аук_Команды.ЗначенияПеречисления Цикл
		
		масКоманды.Добавить(ЭлЗначение.Комментарий);
		
	КонецЦикла;
	
	Возврат масКоманды;
	
КонецФункции	