
#Область ПрограммныйИнтерфейс

Функция ДобавитьЗапись(пСтруктураЗаписи) Экспорт
	
	Если Не пСтруктураЗаписи.Свойство("Автор") Тогда
		
	КонецЕсли;	
	
	сткРез =  Аук_ОбщийСервер.ДобавитьЗаписьВРегистрСведений(пСтруктураЗаписи, "Аук_ДанныеШапокПодведенияИтогов");
	
	Если Не сткРез.Успех Тогда
		ВызватьИсключение сткРез.Ошибка;	
	КонецЕсли;	
	
КонецФункции

Функция УдалитьЗапись(пСтруктураЗаписи) Экспорт
	
	Возврат Аук_ОбщийСервер.УдалитьНаборЗаписейВРегистреСведений(пСтруктураЗаписи, "Аук_ДанныеШапокПодведенияИтогов");
	
КонецФункции	

Функция ТекущиеДанныеШапкиПодведенияИтоговАукциона(пАукцион) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Аук_ДанныеШапокПодведенияИтогов.ОбщаяСумма КАК ОбщаяСумма,
	|	Аук_ДанныеШапокПодведенияИтогов.ОбщийСрок КАК ОбщийСрок
	|ИЗ
	|	РегистрСведений.Аук_ДанныеШапокПодведенияИтогов КАК Аук_ДанныеШапокПодведенияИтогов
	|ГДЕ
	|	Аук_ДанныеШапокПодведенияИтогов.Аукцион = &Аукцион";
	
	Запрос.УстановитьПараметр("Аукцион", пАукцион);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Возврат ЭдоОбщийСервер.РезультатЗапросаВСтруктуру(РезультатЗапроса);
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;	
	
КонецФункции	

Функция СтруктураЗаписи() Экспорт

	сткРезультат = Новый Структура;
	
	сткРезультат.Вставить("Аукцион",		);
	сткРезультат.Вставить("ОбщаяСумма",		);
	сткРезультат.Вставить("ОбщийСрок",		);
	сткРезультат.Вставить("Автор",			?(ЗначениеЗаполнено(ПараметрыСеанса.глТекПользователь),
												ПараметрыСеанса.глТекПользователь,
												ПредопределенноеЗначение("Справочник.УБД_Пользователи.Система")));
												
	сткРезультат.Вставить("ДатаЗаписи",		ОбщегоНазначенияВызовСервера.ТекущаяДатаСервер_());
	
	Возврат сткРезультат;
	
КонецФункции	

#КонецОбласти